espressif/arduino-esp32/boards.txt
##############################################################

tinypico.name=UM TinyPICO

tinypico.upload.tool=esptool_py
tinypico.upload.maximum_size=1310720
tinypico.upload.maximum_data_size=327680
tinypico.upload.flags=
tinypico.upload.extra_flags=

tinypico.serial.disableDTR=true
tinypico.serial.disableRTS=true

tinypico.build.tarch=xtensa
tinypico.build.bootloader_addr=0x1000
tinypico.build.target=esp32
tinypico.build.mcu=esp32
tinypico.build.core=esp32
tinypico.build.variant=um_tinypico
tinypico.build.board=TINYPICO

tinypico.build.f_cpu=240000000L
tinypico.build.flash_size=4MB
tinypico.build.flash_freq=80m
tinypico.build.flash_mode=dio
tinypico.build.boot=dio
tinypico.build.partitions=default
tinypico.build.defines=

tinypico.menu.PartitionScheme.default=Default
tinypico.menu.PartitionScheme.default.build.partitions=default
tinypico.menu.PartitionScheme.no_ota=No OTA (Large APP)
tinypico.menu.PartitionScheme.no_ota.build.partitions=no_ota
tinypico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
tinypico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
tinypico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
tinypico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

tinypico.menu.UploadSpeed.921600=921600
tinypico.menu.UploadSpeed.921600.upload.speed=921600
tinypico.menu.UploadSpeed.115200=115200
tinypico.menu.UploadSpeed.115200.upload.speed=115200
tinypico.menu.UploadSpeed.256000.windows=256000
tinypico.menu.UploadSpeed.256000.upload.speed=256000
tinypico.menu.UploadSpeed.230400.windows.upload.speed=256000
tinypico.menu.UploadSpeed.230400=230400
tinypico.menu.UploadSpeed.230400.upload.speed=230400
tinypico.menu.UploadSpeed.460800.linux=460800
tinypico.menu.UploadSpeed.460800.macosx=460800
tinypico.menu.UploadSpeed.460800.upload.speed=460800
tinypico.menu.UploadSpeed.512000.windows=512000
tinypico.menu.UploadSpeed.512000.upload.speed=512000

tinypico.menu.FlashMode.qio=QIO
tinypico.menu.FlashMode.qio.build.flash_mode=dio
tinypico.menu.FlashMode.qio.build.boot=qio
tinypico.menu.FlashMode.dio=DIO
tinypico.menu.FlashMode.dio.build.flash_mode=dio
tinypico.menu.FlashMode.dio.build.boot=dio

tinypico.menu.FlashFreq.80=80MHz
tinypico.menu.FlashFreq.80.build.flash_freq=80m
tinypico.menu.FlashFreq.40=40MHz
tinypico.menu.FlashFreq.40.build.flash_freq=40m

tinypico.menu.PSRAM.enabled=Enabled
tinypico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
tinypico.menu.PSRAM.enabled.build.extra_libs=
tinypico.menu.PSRAM.disabled=Disabled
tinypico.menu.PSRAM.disabled.build.defines=
tinypico.menu.PSRAM.disabled.build.extra_libs=

tinypico.menu.DebugLevel.none=None
tinypico.menu.DebugLevel.none.build.code_debug=0
tinypico.menu.DebugLevel.error=Error
tinypico.menu.DebugLevel.error.build.code_debug=1
tinypico.menu.DebugLevel.warn=Warn
tinypico.menu.DebugLevel.warn.build.code_debug=2
tinypico.menu.DebugLevel.info=Info
tinypico.menu.DebugLevel.info.build.code_debug=3
tinypico.menu.DebugLevel.debug=Debug
tinypico.menu.DebugLevel.debug.build.code_debug=4
tinypico.menu.DebugLevel.verbose=Verbose
tinypico.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

feathers2.name=UM FeatherS2
feathers2.vid.0=0x239A
feathers2.pid.0=0x80AB

feathers2.upload.tool=esptool_py
feathers2.upload.maximum_size=1310720
feathers2.upload.maximum_data_size=327680
feathers2.upload.flags=
feathers2.upload.extra_flags=
feathers2.upload.use_1200bps_touch=true
feathers2.upload.wait_for_upload_port=true

feathers2.serial.disableDTR=false
feathers2.serial.disableRTS=false

feathers2.build.tarch=xtensa
feathers2.build.bootloader_addr=0x1000
feathers2.build.target=esp32s2
feathers2.build.mcu=esp32s2
feathers2.build.core=esp32
feathers2.build.variant=um_feathers2
feathers2.build.board=FEATHERS2

feathers2.build.cdc_on_boot=1
feathers2.build.msc_on_boot=0
feathers2.build.dfu_on_boot=0
feathers2.build.f_cpu=240000000L
feathers2.build.flash_size=16MB
feathers2.build.flash_freq=80m
feathers2.build.flash_mode=dio
feathers2.build.boot=qio
feathers2.build.partitions=fatflash
feathers2.build.defines=

feathers2.menu.CDCOnBoot.cdc=Enabled
feathers2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
feathers2.menu.CDCOnBoot.default=Disabled
feathers2.menu.CDCOnBoot.default.build.cdc_on_boot=0

feathers2.menu.MSCOnBoot.default=Disabled
feathers2.menu.MSCOnBoot.default.build.msc_on_boot=0
feathers2.menu.MSCOnBoot.msc=Enabled
feathers2.menu.MSCOnBoot.msc.build.msc_on_boot=1

feathers2.menu.DFUOnBoot.default=Disabled
feathers2.menu.DFUOnBoot.default.build.dfu_on_boot=0
feathers2.menu.DFUOnBoot.dfu=Enabled
feathers2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

feathers2.menu.PSRAM.enabled=Enabled
feathers2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
feathers2.menu.PSRAM.disabled=Disabled
feathers2.menu.PSRAM.disabled.build.defines=

feathers2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
feathers2.menu.PartitionScheme.fatflash.build.partitions=ffat
feathers2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
feathers2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
feathers2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
feathers2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
feathers2.menu.PartitionScheme.default.build.partitions=default
feathers2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
feathers2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
feathers2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
feathers2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
feathers2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
feathers2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
feathers2.menu.PartitionScheme.minimal.build.partitions=minimal
feathers2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
feathers2.menu.PartitionScheme.no_ota.build.partitions=no_ota
feathers2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
feathers2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
feathers2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
feathers2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
feathers2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
feathers2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
feathers2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
feathers2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
feathers2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
feathers2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
feathers2.menu.PartitionScheme.huge_app.build.partitions=huge_app
feathers2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
feathers2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
feathers2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
feathers2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

