espressif/arduino-esp32/boards.txt
##############################################################

widora-air.name=Widora AIR

widora-air.upload.tool=esptool_py
widora-air.upload.maximum_size=1310720
widora-air.upload.maximum_data_size=327680
widora-air.upload.flags=
widora-air.upload.extra_flags=

widora-air.serial.disableDTR=true
widora-air.serial.disableRTS=true

widora-air.build.tarch=xtensa
widora-air.build.bootloader_addr=0x1000
widora-air.build.target=esp32
widora-air.build.mcu=esp32
widora-air.build.core=esp32
widora-air.build.variant=widora-air
widora-air.build.board=WIDORA_AIR

widora-air.build.f_cpu=240000000L
widora-air.build.flash_mode=dio
widora-air.build.flash_size=16MB
widora-air.build.boot=dio
widora-air.build.partitions=default
widora-air.build.defines=

widora-air.menu.FlashFreq.80=80MHz
widora-air.menu.FlashFreq.80.build.flash_freq=80m
widora-air.menu.FlashFreq.40=40MHz
widora-air.menu.FlashFreq.40.build.flash_freq=40m

widora-air.menu.UploadSpeed.921600=921600
widora-air.menu.UploadSpeed.921600.upload.speed=921600
widora-air.menu.UploadSpeed.115200=115200
widora-air.menu.UploadSpeed.115200.upload.speed=115200
widora-air.menu.UploadSpeed.256000.windows=256000
widora-air.menu.UploadSpeed.256000.upload.speed=256000
widora-air.menu.UploadSpeed.230400.windows.upload.speed=256000
widora-air.menu.UploadSpeed.230400=230400
widora-air.menu.UploadSpeed.230400.upload.speed=230400
widora-air.menu.UploadSpeed.460800.linux=460800
widora-air.menu.UploadSpeed.460800.macosx=460800
widora-air.menu.UploadSpeed.460800.upload.speed=460800
widora-air.menu.UploadSpeed.512000.windows=512000
widora-air.menu.UploadSpeed.512000.upload.speed=512000

widora-air.menu.DebugLevel.none=None
widora-air.menu.DebugLevel.none.build.code_debug=0
widora-air.menu.DebugLevel.error=Error
widora-air.menu.DebugLevel.error.build.code_debug=1
widora-air.menu.DebugLevel.warn=Warn
widora-air.menu.DebugLevel.warn.build.code_debug=2
widora-air.menu.DebugLevel.info=Info
widora-air.menu.DebugLevel.info.build.code_debug=3
widora-air.menu.DebugLevel.debug=Debug
widora-air.menu.DebugLevel.debug.build.code_debug=4
widora-air.menu.DebugLevel.verbose=Verbose
widora-air.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

esp320.name=Electronic SweetPeas - ESP320

esp320.upload.tool=esptool_py
esp320.upload.maximum_size=1310720
esp320.upload.maximum_data_size=327680
esp320.upload.flags=
esp320.upload.extra_flags=

esp320.serial.disableDTR=true
esp320.serial.disableRTS=true

esp320.build.tarch=xtensa
esp320.build.bootloader_addr=0x1000
esp320.build.target=esp32
esp320.build.mcu=esp32
esp320.build.core=esp32
esp320.build.variant=esp320
esp320.build.board=ESP320

esp320.build.f_cpu=240000000L
esp320.build.flash_mode=qio
esp320.build.flash_size=4MB
esp320.build.boot=dio
esp320.build.partitions=default
esp320.build.defines=

esp320.menu.FlashFreq.80=80MHz
esp320.menu.FlashFreq.80.build.flash_freq=80m
esp320.menu.FlashFreq.40=40MHz
esp320.menu.FlashFreq.40.build.flash_freq=40m

esp320.menu.UploadSpeed.921600=921600
esp320.menu.UploadSpeed.921600.upload.speed=921600
esp320.menu.UploadSpeed.115200=115200
esp320.menu.UploadSpeed.115200.upload.speed=115200
esp320.menu.UploadSpeed.256000.windows=256000
esp320.menu.UploadSpeed.256000.upload.speed=256000
esp320.menu.UploadSpeed.230400.windows.upload.speed=256000
esp320.menu.UploadSpeed.230400=230400
esp320.menu.UploadSpeed.230400.upload.speed=230400
esp320.menu.UploadSpeed.460800.linux=460800
esp320.menu.UploadSpeed.460800.macosx=460800
esp320.menu.UploadSpeed.460800.upload.speed=460800
esp320.menu.UploadSpeed.512000.windows=512000
esp320.menu.UploadSpeed.512000.upload.speed=512000

esp320.menu.DebugLevel.none=None
esp320.menu.DebugLevel.none.build.code_debug=0
esp320.menu.DebugLevel.error=Error
esp320.menu.DebugLevel.error.build.code_debug=1
esp320.menu.DebugLevel.warn=Warn
esp320.menu.DebugLevel.warn.build.code_debug=2
esp320.menu.DebugLevel.info=Info
esp320.menu.DebugLevel.info.build.code_debug=3
esp320.menu.DebugLevel.debug=Debug
esp320.menu.DebugLevel.debug.build.code_debug=4
esp320.menu.DebugLevel.verbose=Verbose
esp320.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

nano32.name=Nano32

nano32.upload.tool=esptool_py
nano32.upload.maximum_size=1310720
nano32.upload.maximum_data_size=327680
nano32.upload.flags=
nano32.upload.extra_flags=

nano32.serial.disableDTR=true
nano32.serial.disableRTS=true

nano32.build.tarch=xtensa
nano32.build.bootloader_addr=0x1000
nano32.build.target=esp32
nano32.build.mcu=esp32
nano32.build.core=esp32
nano32.build.variant=nano32
nano32.build.board=NANO32

nano32.build.f_cpu=240000000L
nano32.build.flash_mode=dio
nano32.build.flash_size=4MB
nano32.build.boot=dio
nano32.build.partitions=default
nano32.build.defines=

nano32.menu.FlashFreq.80=80MHz
nano32.menu.FlashFreq.80.build.flash_freq=80m
nano32.menu.FlashFreq.40=40MHz
nano32.menu.FlashFreq.40.build.flash_freq=40m

nano32.menu.UploadSpeed.921600=921600
nano32.menu.UploadSpeed.921600.upload.speed=921600
nano32.menu.UploadSpeed.115200=115200
nano32.menu.UploadSpeed.115200.upload.speed=115200
nano32.menu.UploadSpeed.256000.windows=256000
nano32.menu.UploadSpeed.256000.upload.speed=256000
nano32.menu.UploadSpeed.230400.windows.upload.speed=256000
nano32.menu.UploadSpeed.230400=230400
nano32.menu.UploadSpeed.230400.upload.speed=230400
nano32.menu.UploadSpeed.460800.linux=460800
nano32.menu.UploadSpeed.460800.macosx=460800
nano32.menu.UploadSpeed.460800.upload.speed=460800
nano32.menu.UploadSpeed.512000.windows=512000
nano32.menu.UploadSpeed.512000.upload.speed=512000

nano32.menu.DebugLevel.none=None
nano32.menu.DebugLevel.none.build.code_debug=0
nano32.menu.DebugLevel.error=Error
nano32.menu.DebugLevel.error.build.code_debug=1
nano32.menu.DebugLevel.warn=Warn
nano32.menu.DebugLevel.warn.build.code_debug=2
nano32.menu.DebugLevel.info=Info
nano32.menu.DebugLevel.info.build.code_debug=3
nano32.menu.DebugLevel.debug=Debug
nano32.menu.DebugLevel.debug.build.code_debug=4
nano32.menu.DebugLevel.verbose=Verbose
nano32.menu.DebugLevel.verbose.build.code_debug=5

