espressif/arduino-esp32/boards.txt
##############################################################

d32.name=LOLIN D32

d32.upload.tool=esptool_py
d32.upload.maximum_size=1310720
d32.upload.maximum_data_size=327680
d32.upload.flags=
d32.upload.extra_flags=

d32.serial.disableDTR=true
d32.serial.disableRTS=true

d32.build.tarch=xtensa
d32.build.bootloader_addr=0x1000
d32.build.target=esp32
d32.build.mcu=esp32
d32.build.core=esp32
d32.build.variant=d32
d32.build.board=LOLIN_D32

d32.build.f_cpu=240000000L
d32.build.flash_size=4MB
d32.build.flash_freq=40m
d32.build.flash_mode=dio
d32.build.boot=dio
d32.build.partitions=default
d32.build.defines=

d32.menu.PartitionScheme.default=Default
d32.menu.PartitionScheme.default.build.partitions=default
d32.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
d32.menu.PartitionScheme.minimal.build.partitions=minimal
d32.menu.PartitionScheme.no_ota=No OTA (Large APP)
d32.menu.PartitionScheme.no_ota.build.partitions=no_ota
d32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

d32.menu.FlashFreq.80=80MHz
d32.menu.FlashFreq.80.build.flash_freq=80m
d32.menu.FlashFreq.40=40MHz
d32.menu.FlashFreq.40.build.flash_freq=40m

d32.menu.UploadSpeed.921600=921600
d32.menu.UploadSpeed.921600.upload.speed=921600
d32.menu.UploadSpeed.115200=115200
d32.menu.UploadSpeed.115200.upload.speed=115200
d32.menu.UploadSpeed.256000.windows=256000
d32.menu.UploadSpeed.256000.upload.speed=256000
d32.menu.UploadSpeed.230400.windows.upload.speed=256000
d32.menu.UploadSpeed.230400=230400
d32.menu.UploadSpeed.230400.upload.speed=230400
d32.menu.UploadSpeed.460800.linux=460800
d32.menu.UploadSpeed.460800.macosx=460800
d32.menu.UploadSpeed.460800.upload.speed=460800
d32.menu.UploadSpeed.512000.windows=512000
d32.menu.UploadSpeed.512000.upload.speed=512000

d32.menu.DebugLevel.none=None
d32.menu.DebugLevel.none.build.code_debug=0
d32.menu.DebugLevel.error=Error
d32.menu.DebugLevel.error.build.code_debug=1
d32.menu.DebugLevel.warn=Warn
d32.menu.DebugLevel.warn.build.code_debug=2
d32.menu.DebugLevel.info=Info
d32.menu.DebugLevel.info.build.code_debug=3
d32.menu.DebugLevel.debug=Debug
d32.menu.DebugLevel.debug.build.code_debug=4
d32.menu.DebugLevel.verbose=Verbose
d32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

d32_pro.name=LOLIN D32 PRO

d32_pro.upload.tool=esptool_py
d32_pro.upload.maximum_size=1310720
d32_pro.upload.maximum_data_size=327680
d32_pro.upload.flags=
d32_pro.upload.extra_flags=

d32_pro.serial.disableDTR=true
d32_pro.serial.disableRTS=true

d32_pro.build.tarch=xtensa
d32_pro.build.bootloader_addr=0x1000
d32_pro.build.target=esp32
d32_pro.build.mcu=esp32
d32_pro.build.core=esp32
d32_pro.build.variant=d32_pro
d32_pro.build.board=LOLIN_D32_PRO

d32_pro.build.f_cpu=240000000L
d32_pro.build.flash_size=4MB
d32_pro.build.flash_freq=40m
d32_pro.build.flash_mode=dio
d32_pro.build.boot=dio
d32_pro.build.partitions=default
d32_pro.build.defines=

d32_pro.menu.PSRAM.disabled=Disabled
d32_pro.menu.PSRAM.disabled.build.defines=
d32_pro.menu.PSRAM.disabled.build.extra_libs=
d32_pro.menu.PSRAM.enabled=Enabled
d32_pro.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
d32_pro.menu.PSRAM.enabled.build.extra_libs=

d32_pro.menu.PartitionScheme.default=Default
d32_pro.menu.PartitionScheme.default.build.partitions=default
d32_pro.menu.PartitionScheme.minimal=Minimal (2MB FLASH)
d32_pro.menu.PartitionScheme.minimal.build.partitions=minimal
d32_pro.menu.PartitionScheme.no_ota=No OTA (Large APP)
d32_pro.menu.PartitionScheme.no_ota.build.partitions=no_ota
d32_pro.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
d32_pro.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
d32_pro.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
d32_pro.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

d32_pro.menu.FlashFreq.80=80MHz
d32_pro.menu.FlashFreq.80.build.flash_freq=80m
d32_pro.menu.FlashFreq.40=40MHz
d32_pro.menu.FlashFreq.40.build.flash_freq=40m

d32_pro.menu.UploadSpeed.921600=921600
d32_pro.menu.UploadSpeed.921600.upload.speed=921600
d32_pro.menu.UploadSpeed.115200=115200
d32_pro.menu.UploadSpeed.115200.upload.speed=115200
d32_pro.menu.UploadSpeed.256000.windows=256000
d32_pro.menu.UploadSpeed.256000.upload.speed=256000
d32_pro.menu.UploadSpeed.230400.windows.upload.speed=256000
d32_pro.menu.UploadSpeed.230400=230400
d32_pro.menu.UploadSpeed.230400.upload.speed=230400
d32_pro.menu.UploadSpeed.460800.linux=460800
d32_pro.menu.UploadSpeed.460800.macosx=460800
d32_pro.menu.UploadSpeed.460800.upload.speed=460800
d32_pro.menu.UploadSpeed.512000.windows=512000
d32_pro.menu.UploadSpeed.512000.upload.speed=512000
d32_pro.menu.UploadSpeed.1500000=1500000
d32_pro.menu.UploadSpeed.1500000.upload.speed=1500000

d32_pro.menu.DebugLevel.none=None
d32_pro.menu.DebugLevel.none.build.code_debug=0
d32_pro.menu.DebugLevel.error=Error
d32_pro.menu.DebugLevel.error.build.code_debug=1
d32_pro.menu.DebugLevel.warn=Warn
d32_pro.menu.DebugLevel.warn.build.code_debug=2
d32_pro.menu.DebugLevel.info=Info
d32_pro.menu.DebugLevel.info.build.code_debug=3
d32_pro.menu.DebugLevel.debug=Debug
d32_pro.menu.DebugLevel.debug.build.code_debug=4
d32_pro.menu.DebugLevel.verbose=Verbose
d32_pro.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

lolin_c3_mini.name=LOLIN C3 Mini
lolin_c3_mini.vid.0=0x303a
lolin_c3_mini.pid.0=0x1001

lolin_c3_mini.upload.tool=esptool_py
lolin_c3_mini.upload.maximum_size=1310720
lolin_c3_mini.upload.maximum_data_size=327680
lolin_c3_mini.upload.flags=
lolin_c3_mini.upload.extra_flags=
lolin_c3_mini.upload.use_1200bps_touch=false
lolin_c3_mini.upload.wait_for_upload_port=false

lolin_c3_mini.serial.disableDTR=true
lolin_c3_mini.serial.disableRTS=true

lolin_c3_mini.build.tarch=riscv32
lolin_c3_mini.build.target=esp
lolin_c3_mini.build.mcu=esp32c3
lolin_c3_mini.build.core=esp32
lolin_c3_mini.build.variant=lolin_c3_mini
lolin_c3_mini.build.board=LOLIN_C3_MINI
lolin_c3_mini.build.bootloader_addr=0x0

lolin_c3_mini.build.cdc_on_boot=1
lolin_c3_mini.build.f_cpu=160000000L
lolin_c3_mini.build.flash_size=4MB
lolin_c3_mini.build.flash_freq=80m
lolin_c3_mini.build.flash_mode=dio
lolin_c3_mini.build.boot=qio
lolin_c3_mini.build.partitions=default
lolin_c3_mini.build.defines=

lolin_c3_mini.menu.CDCOnBoot.default=Enabled
lolin_c3_mini.menu.CDCOnBoot.default.build.cdc_on_boot=1
lolin_c3_mini.menu.CDCOnBoot.dis_cdc=Disabled
lolin_c3_mini.menu.CDCOnBoot.dis_cdc.build.cdc_on_boot=0

lolin_c3_mini.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
lolin_c3_mini.menu.PartitionScheme.default.build.partitions=default
lolin_c3_mini.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
lolin_c3_mini.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
lolin_c3_mini.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
lolin_c3_mini.menu.PartitionScheme.no_ota.build.partitions=no_ota
lolin_c3_mini.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
lolin_c3_mini.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
lolin_c3_mini.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
lolin_c3_mini.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
lolin_c3_mini.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
lolin_c3_mini.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
lolin_c3_mini.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
lolin_c3_mini.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
lolin_c3_mini.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
lolin_c3_mini.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
lolin_c3_mini.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
lolin_c3_mini.menu.PartitionScheme.huge_app.build.partitions=huge_app
lolin_c3_mini.menu.PartitionScheme.huge_app.upload.maximum_size=3145728


lolin_c3_mini.menu.CPUFreq.160=160MHz (WiFi)
lolin_c3_mini.menu.CPUFreq.160.build.f_cpu=160000000L
lolin_c3_mini.menu.CPUFreq.80=80MHz (WiFi)
lolin_c3_mini.menu.CPUFreq.80.build.f_cpu=80000000L
lolin_c3_mini.menu.CPUFreq.40=40MHz
lolin_c3_mini.menu.CPUFreq.40.build.f_cpu=40000000L
lolin_c3_mini.menu.CPUFreq.20=20MHz
lolin_c3_mini.menu.CPUFreq.20.build.f_cpu=20000000L
lolin_c3_mini.menu.CPUFreq.10=10MHz
lolin_c3_mini.menu.CPUFreq.10.build.f_cpu=10000000L



lolin_c3_mini.menu.FlashFreq.80=80MHz
lolin_c3_mini.menu.FlashFreq.80.build.flash_freq=80m
lolin_c3_mini.menu.FlashFreq.40=40MHz
lolin_c3_mini.menu.FlashFreq.40.build.flash_freq=40m

lolin_c3_mini.menu.UploadSpeed.921600=921600
lolin_c3_mini.menu.UploadSpeed.921600.upload.speed=921600
lolin_c3_mini.menu.UploadSpeed.115200=115200
lolin_c3_mini.menu.UploadSpeed.115200.upload.speed=115200
lolin_c3_mini.menu.UploadSpeed.256000.windows=256000
lolin_c3_mini.menu.UploadSpeed.256000.upload.speed=256000
lolin_c3_mini.menu.UploadSpeed.230400.windows.upload.speed=256000
lolin_c3_mini.menu.UploadSpeed.230400=230400
lolin_c3_mini.menu.UploadSpeed.230400.upload.speed=230400
lolin_c3_mini.menu.UploadSpeed.460800.linux=460800
lolin_c3_mini.menu.UploadSpeed.460800.macosx=460800
lolin_c3_mini.menu.UploadSpeed.460800.upload.speed=460800
lolin_c3_mini.menu.UploadSpeed.512000.windows=512000
lolin_c3_mini.menu.UploadSpeed.512000.upload.speed=512000

