espressif/arduino-esp32/boards.txt
##############################################################

pocket_32.name=Dongsen Tech Pocket 32

pocket_32.upload.tool=esptool_py
pocket_32.upload.maximum_size=1310720
pocket_32.upload.maximum_data_size=327680
pocket_32.upload.flags=
pocket_32.upload.extra_flags=

pocket_32.serial.disableDTR=true
pocket_32.serial.disableRTS=true

pocket_32.build.tarch=xtensa
pocket_32.build.bootloader_addr=0x1000
pocket_32.build.target=esp32
pocket_32.build.mcu=esp32
pocket_32.build.core=esp32
pocket_32.build.variant=pocket_32
pocket_32.build.board=Pocket32

pocket_32.build.f_cpu=240000000L
pocket_32.build.flash_mode=dio
pocket_32.build.flash_size=4MB
pocket_32.build.boot=dio
pocket_32.build.partitions=default
pocket_32.build.defines=

pocket_32.menu.FlashFreq.80=80MHz
pocket_32.menu.FlashFreq.80.build.flash_freq=80m
pocket_32.menu.FlashFreq.40=40MHz
pocket_32.menu.FlashFreq.40.build.flash_freq=40m

pocket_32.menu.UploadSpeed.921600=921600
pocket_32.menu.UploadSpeed.921600.upload.speed=921600
pocket_32.menu.UploadSpeed.115200=115200
pocket_32.menu.UploadSpeed.115200.upload.speed=115200
pocket_32.menu.UploadSpeed.256000.windows=256000
pocket_32.menu.UploadSpeed.256000.upload.speed=256000
pocket_32.menu.UploadSpeed.230400.windows.upload.speed=256000
pocket_32.menu.UploadSpeed.230400=230400
pocket_32.menu.UploadSpeed.230400.upload.speed=230400
pocket_32.menu.UploadSpeed.460800.linux=460800
pocket_32.menu.UploadSpeed.460800.macosx=460800
pocket_32.menu.UploadSpeed.460800.upload.speed=460800
pocket_32.menu.UploadSpeed.512000.windows=512000
pocket_32.menu.UploadSpeed.512000.upload.speed=512000

pocket_32.menu.DebugLevel.none=None
pocket_32.menu.DebugLevel.none.build.code_debug=0
pocket_32.menu.DebugLevel.error=Error
pocket_32.menu.DebugLevel.error.build.code_debug=1
pocket_32.menu.DebugLevel.warn=Warn
pocket_32.menu.DebugLevel.warn.build.code_debug=2
pocket_32.menu.DebugLevel.info=Info
pocket_32.menu.DebugLevel.info.build.code_debug=3
pocket_32.menu.DebugLevel.debug=Debug
pocket_32.menu.DebugLevel.debug.build.code_debug=4
pocket_32.menu.DebugLevel.verbose=Verbose
pocket_32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

WeMosBat.name=WeMos WiFi&Bluetooth Battery

WeMosBat.upload.tool=esptool_py
WeMosBat.upload.maximum_size=1310720
WeMosBat.upload.maximum_data_size=327680
WeMosBat.upload.flags=
WeMosBat.upload.extra_flags=

WeMosBat.serial.disableDTR=true
WeMosBat.serial.disableRTS=true

WeMosBat.build.tarch=xtensa
WeMosBat.build.bootloader_addr=0x1000
WeMosBat.build.target=esp32
WeMosBat.build.mcu=esp32
WeMosBat.build.core=esp32
WeMosBat.build.variant=pocket_32
WeMosBat.build.board=Pocket32

WeMosBat.build.f_cpu=240000000L
WeMosBat.build.flash_mode=dio
WeMosBat.build.flash_size=4MB
WeMosBat.build.boot=dio
WeMosBat.build.partitions=default
WeMosBat.build.defines=

WeMosBat.menu.FlashFreq.80=80MHz
WeMosBat.menu.FlashFreq.80.build.flash_freq=80m
WeMosBat.menu.FlashFreq.40=40MHz
WeMosBat.menu.FlashFreq.40.build.flash_freq=40m

WeMosBat.menu.UploadSpeed.921600=921600
WeMosBat.menu.UploadSpeed.921600.upload.speed=921600
WeMosBat.menu.UploadSpeed.115200=115200
WeMosBat.menu.UploadSpeed.115200.upload.speed=115200
WeMosBat.menu.UploadSpeed.256000.windows=256000
WeMosBat.menu.UploadSpeed.256000.upload.speed=256000
WeMosBat.menu.UploadSpeed.230400.windows.upload.speed=256000
WeMosBat.menu.UploadSpeed.230400=230400
WeMosBat.menu.UploadSpeed.230400.upload.speed=230400
WeMosBat.menu.UploadSpeed.460800.linux=460800
WeMosBat.menu.UploadSpeed.460800.macosx=460800
WeMosBat.menu.UploadSpeed.460800.upload.speed=460800
WeMosBat.menu.UploadSpeed.512000.windows=512000
WeMosBat.menu.UploadSpeed.512000.upload.speed=512000

WeMosBat.menu.DebugLevel.none=None
WeMosBat.menu.DebugLevel.none.build.code_debug=0
WeMosBat.menu.DebugLevel.error=Error
WeMosBat.menu.DebugLevel.error.build.code_debug=1
WeMosBat.menu.DebugLevel.warn=Warn
WeMosBat.menu.DebugLevel.warn.build.code_debug=2
WeMosBat.menu.DebugLevel.info=Info
WeMosBat.menu.DebugLevel.info.build.code_debug=3
WeMosBat.menu.DebugLevel.debug=Debug
WeMosBat.menu.DebugLevel.debug.build.code_debug=4
WeMosBat.menu.DebugLevel.verbose=Verbose
WeMosBat.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

espea32.name=ESPea32

espea32.upload.tool=esptool_py
espea32.upload.maximum_size=1310720
espea32.upload.maximum_data_size=327680
espea32.upload.flags=
espea32.upload.extra_flags=

espea32.serial.disableDTR=true
espea32.serial.disableRTS=true

espea32.build.tarch=xtensa
espea32.build.bootloader_addr=0x1000
espea32.build.target=esp32
espea32.build.mcu=esp32
espea32.build.core=esp32
espea32.build.variant=espea32
espea32.build.board=ESPea32

espea32.build.f_cpu=240000000L
espea32.build.flash_mode=dio
espea32.build.flash_size=4MB
espea32.build.boot=dio
espea32.build.partitions=default
espea32.build.defines=

espea32.menu.FlashFreq.80=80MHz
espea32.menu.FlashFreq.80.build.flash_freq=80m
espea32.menu.FlashFreq.40=40MHz
espea32.menu.FlashFreq.40.build.flash_freq=40m

espea32.menu.UploadSpeed.921600=921600
espea32.menu.UploadSpeed.921600.upload.speed=921600
espea32.menu.UploadSpeed.115200=115200
espea32.menu.UploadSpeed.115200.upload.speed=115200
espea32.menu.UploadSpeed.256000.windows=256000
espea32.menu.UploadSpeed.256000.upload.speed=256000
espea32.menu.UploadSpeed.230400.windows.upload.speed=256000
espea32.menu.UploadSpeed.230400=230400
espea32.menu.UploadSpeed.230400.upload.speed=230400
espea32.menu.UploadSpeed.460800.linux=460800
espea32.menu.UploadSpeed.460800.macosx=460800
espea32.menu.UploadSpeed.460800.upload.speed=460800
espea32.menu.UploadSpeed.512000.windows=512000
espea32.menu.UploadSpeed.512000.upload.speed=512000

espea32.menu.DebugLevel.none=None
espea32.menu.DebugLevel.none.build.code_debug=0
espea32.menu.DebugLevel.error=Error
espea32.menu.DebugLevel.error.build.code_debug=1
espea32.menu.DebugLevel.warn=Warn
espea32.menu.DebugLevel.warn.build.code_debug=2
espea32.menu.DebugLevel.info=Info
espea32.menu.DebugLevel.info.build.code_debug=3
espea32.menu.DebugLevel.debug=Debug
espea32.menu.DebugLevel.debug.build.code_debug=4
espea32.menu.DebugLevel.verbose=Verbose
espea32.menu.DebugLevel.verbose.build.code_debug=5

