espressif/arduino-esp32/boards.txt
##############################################################

hornbill32minima.name=Hornbill ESP32 Minima

hornbill32minima.upload.tool=esptool_py
hornbill32minima.upload.maximum_size=1310720
hornbill32minima.upload.maximum_data_size=327680
hornbill32minima.upload.flags=
hornbill32minima.upload.extra_flags=

hornbill32minima.serial.disableDTR=true
hornbill32minima.serial.disableRTS=true

hornbill32minima.build.tarch=xtensa
hornbill32minima.build.bootloader_addr=0x1000
hornbill32minima.build.target=esp32
hornbill32minima.build.mcu=esp32
hornbill32minima.build.core=esp32
hornbill32minima.build.variant=hornbill32minima
hornbill32minima.build.board=HORNBILL_ESP32_MINIMA
hornbill32minima.build.f_cpu=240000000L
hornbill32minima.build.flash_mode=dio
hornbill32minima.build.flash_size=4MB
hornbill32minima.build.boot=dio
hornbill32minima.build.partitions=default
hornbill32minima.build.defines=

hornbill32minima.menu.FlashFreq.80=80MHz
hornbill32minima.menu.FlashFreq.80.build.flash_freq=80m
hornbill32minima.menu.FlashFreq.40=40MHz
hornbill32minima.menu.FlashFreq.40.build.flash_freq=40m

hornbill32minima.menu.UploadSpeed.921600=921600
hornbill32minima.menu.UploadSpeed.921600.upload.speed=921600
hornbill32minima.menu.UploadSpeed.115200=115200
hornbill32minima.menu.UploadSpeed.115200.upload.speed=115200
hornbill32minima.menu.UploadSpeed.256000.windows=256000
hornbill32minima.menu.UploadSpeed.256000.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400.windows.upload.speed=256000
hornbill32minima.menu.UploadSpeed.230400=230400
hornbill32minima.menu.UploadSpeed.230400.upload.speed=230400
hornbill32minima.menu.UploadSpeed.460800.linux=460800
hornbill32minima.menu.UploadSpeed.460800.macosx=460800
hornbill32minima.menu.UploadSpeed.460800.upload.speed=460800
hornbill32minima.menu.UploadSpeed.512000.windows=512000
hornbill32minima.menu.UploadSpeed.512000.upload.speed=512000

hornbill32minima.menu.DebugLevel.none=None
hornbill32minima.menu.DebugLevel.none.build.code_debug=0
hornbill32minima.menu.DebugLevel.error=Error
hornbill32minima.menu.DebugLevel.error.build.code_debug=1
hornbill32minima.menu.DebugLevel.warn=Warn
hornbill32minima.menu.DebugLevel.warn.build.code_debug=2
hornbill32minima.menu.DebugLevel.info=Info
hornbill32minima.menu.DebugLevel.info.build.code_debug=3
hornbill32minima.menu.DebugLevel.debug=Debug
hornbill32minima.menu.DebugLevel.debug.build.code_debug=4
hornbill32minima.menu.DebugLevel.verbose=Verbose
hornbill32minima.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

firebeetle32.name=FireBeetle-ESP32

firebeetle32.upload.tool=esptool_py
firebeetle32.upload.maximum_size=1310720
firebeetle32.upload.maximum_data_size=327680
firebeetle32.upload.flags=
firebeetle32.upload.extra_flags=

firebeetle32.serial.disableDTR=true
firebeetle32.serial.disableRTS=true

firebeetle32.build.tarch=xtensa
firebeetle32.build.bootloader_addr=0x1000
firebeetle32.build.target=esp32
firebeetle32.build.mcu=esp32
firebeetle32.build.core=esp32
firebeetle32.build.variant=firebeetle32
firebeetle32.build.board=ESP32_DEV

firebeetle32.build.f_cpu=240000000L
firebeetle32.build.flash_mode=dio
firebeetle32.build.flash_size=4MB
firebeetle32.build.boot=dio
firebeetle32.build.partitions=default
firebeetle32.build.defines=

firebeetle32.menu.FlashFreq.80=80MHz
firebeetle32.menu.FlashFreq.80.build.flash_freq=80m
firebeetle32.menu.FlashFreq.40=40MHz
firebeetle32.menu.FlashFreq.40.build.flash_freq=40m

firebeetle32.menu.UploadSpeed.921600=921600
firebeetle32.menu.UploadSpeed.921600.upload.speed=921600
firebeetle32.menu.UploadSpeed.115200=115200
firebeetle32.menu.UploadSpeed.115200.upload.speed=115200
firebeetle32.menu.UploadSpeed.256000.windows=256000
firebeetle32.menu.UploadSpeed.256000.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400.windows.upload.speed=256000
firebeetle32.menu.UploadSpeed.230400=230400
firebeetle32.menu.UploadSpeed.230400.upload.speed=230400
firebeetle32.menu.UploadSpeed.460800.linux=460800
firebeetle32.menu.UploadSpeed.460800.macosx=460800
firebeetle32.menu.UploadSpeed.460800.upload.speed=460800
firebeetle32.menu.UploadSpeed.512000.windows=512000
firebeetle32.menu.UploadSpeed.512000.upload.speed=512000

firebeetle32.menu.DebugLevel.none=None
firebeetle32.menu.DebugLevel.none.build.code_debug=0
firebeetle32.menu.DebugLevel.error=Error
firebeetle32.menu.DebugLevel.error.build.code_debug=1
firebeetle32.menu.DebugLevel.warn=Warn
firebeetle32.menu.DebugLevel.warn.build.code_debug=2
firebeetle32.menu.DebugLevel.info=Info
firebeetle32.menu.DebugLevel.info.build.code_debug=3
firebeetle32.menu.DebugLevel.debug=Debug
firebeetle32.menu.DebugLevel.debug.build.code_debug=4
firebeetle32.menu.DebugLevel.verbose=Verbose
firebeetle32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

intorobot-fig.name=IntoRobot Fig

intorobot-fig.upload.tool=esptool_py
intorobot-fig.upload.maximum_size=1310720
intorobot-fig.upload.maximum_data_size=327680
intorobot-fig.upload.flags=
intorobot-fig.upload.extra_flags=

intorobot-fig.serial.disableDTR=true
intorobot-fig.serial.disableRTS=true

intorobot-fig.build.tarch=xtensa
intorobot-fig.build.bootloader_addr=0x1000
intorobot-fig.build.target=esp32
intorobot-fig.build.mcu=esp32
intorobot-fig.build.core=esp32
intorobot-fig.build.variant=intorobot-fig
intorobot-fig.build.board=INTOROBOT_ESP32_DEV

intorobot-fig.build.f_cpu=240000000L
intorobot-fig.build.flash_mode=dio
intorobot-fig.build.flash_size=4MB
intorobot-fig.build.boot=dio
intorobot-fig.build.partitions=default
intorobot-fig.build.defines=

intorobot-fig.menu.FlashFreq.80=80MHz
intorobot-fig.menu.FlashFreq.80.build.flash_freq=80m
intorobot-fig.menu.FlashFreq.40=40MHz
intorobot-fig.menu.FlashFreq.40.build.flash_freq=40m

intorobot-fig.menu.UploadSpeed.921600=921600
intorobot-fig.menu.UploadSpeed.921600.upload.speed=921600
intorobot-fig.menu.UploadSpeed.115200=115200
intorobot-fig.menu.UploadSpeed.115200.upload.speed=115200
intorobot-fig.menu.UploadSpeed.256000.windows=256000
intorobot-fig.menu.UploadSpeed.256000.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400.windows.upload.speed=256000
intorobot-fig.menu.UploadSpeed.230400=230400
intorobot-fig.menu.UploadSpeed.230400.upload.speed=230400
intorobot-fig.menu.UploadSpeed.460800.linux=460800
intorobot-fig.menu.UploadSpeed.460800.macosx=460800
intorobot-fig.menu.UploadSpeed.460800.upload.speed=460800
intorobot-fig.menu.UploadSpeed.512000.windows=512000
intorobot-fig.menu.UploadSpeed.512000.upload.speed=512000

intorobot-fig.menu.DebugLevel.none=None
intorobot-fig.menu.DebugLevel.none.build.code_debug=0
intorobot-fig.menu.DebugLevel.error=Error
intorobot-fig.menu.DebugLevel.error.build.code_debug=1
intorobot-fig.menu.DebugLevel.warn=Warn
intorobot-fig.menu.DebugLevel.warn.build.code_debug=2
intorobot-fig.menu.DebugLevel.info=Info
intorobot-fig.menu.DebugLevel.info.build.code_debug=3
intorobot-fig.menu.DebugLevel.debug=Debug
intorobot-fig.menu.DebugLevel.debug.build.code_debug=4
intorobot-fig.menu.DebugLevel.verbose=Verbose
intorobot-fig.menu.DebugLevel.verbose.build.code_debug=5

