espressif/arduino-esp32/boards.txt
adafruit_metro_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_metro_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_metro_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_metro_esp32s2.menu.PSRAM.disabled.build.defines=

adafruit_metro_esp32s2.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.default.build.partitions=default
adafruit_metro_esp32s2.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_metro_esp32s2.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
adafruit_metro_esp32s2.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_metro_esp32s2.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
adafruit_metro_esp32s2.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_metro_esp32s2.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_metro_esp32s2.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_metro_esp32s2.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_metro_esp32s2.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_metro_esp32s2.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
adafruit_metro_esp32s2.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
adafruit_metro_esp32s2.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_metro_esp32s2.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
adafruit_metro_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
adafruit_metro_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_metro_esp32s2.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

adafruit_metro_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_metro_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_metro_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_metro_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_metro_esp32s2.menu.CPUFreq.40=40MHz
adafruit_metro_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_metro_esp32s2.menu.CPUFreq.20=20MHz
adafruit_metro_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_metro_esp32s2.menu.CPUFreq.10=10MHz
adafruit_metro_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_metro_esp32s2.menu.FlashMode.qio=QIO
adafruit_metro_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_metro_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_metro_esp32s2.menu.FlashMode.dio=DIO
adafruit_metro_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_metro_esp32s2.menu.FlashMode.dio.build.boot=dio
adafruit_metro_esp32s2.menu.FlashMode.qout=QOUT
adafruit_metro_esp32s2.menu.FlashMode.qout.build.flash_mode=dout
adafruit_metro_esp32s2.menu.FlashMode.qout.build.boot=qout
adafruit_metro_esp32s2.menu.FlashMode.dout=DOUT
adafruit_metro_esp32s2.menu.FlashMode.dout.build.flash_mode=dout
adafruit_metro_esp32s2.menu.FlashMode.dout.build.boot=dout

adafruit_metro_esp32s2.menu.FlashFreq.80=80MHz
adafruit_metro_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_metro_esp32s2.menu.FlashFreq.40=40MHz
adafruit_metro_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_metro_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_metro_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
adafruit_metro_esp32s2.menu.FlashSize.8M=8MB (64Mb)
adafruit_metro_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
adafruit_metro_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
adafruit_metro_esp32s2.menu.FlashSize.2M=2MB (16Mb)
adafruit_metro_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
adafruit_metro_esp32s2.menu.FlashSize.2M.build.partitions=minimal
adafruit_metro_esp32s2.menu.FlashSize.16M=16MB (128Mb)
adafruit_metro_esp32s2.menu.FlashSize.16M.build.flash_size=16MB

adafruit_metro_esp32s2.menu.UploadSpeed.921600=921600
adafruit_metro_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_metro_esp32s2.menu.UploadSpeed.115200=115200
adafruit_metro_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_metro_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_metro_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_metro_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_metro_esp32s2.menu.UploadSpeed.230400=230400
adafruit_metro_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_metro_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_metro_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_metro_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_metro_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_metro_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_metro_esp32s2.menu.DebugLevel.none=None
adafruit_metro_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_metro_esp32s2.menu.DebugLevel.error=Error
adafruit_metro_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_metro_esp32s2.menu.DebugLevel.warn=Warn
adafruit_metro_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_metro_esp32s2.menu.DebugLevel.info=Info
adafruit_metro_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_metro_esp32s2.menu.DebugLevel.debug=Debug
adafruit_metro_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_metro_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_metro_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

