espressif/arduino-esp32/boards.txt
adafruit_funhouse_esp32s2.menu.CPUFreq.240=240MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.160=160MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.80=80MHz (WiFi)
adafruit_funhouse_esp32s2.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.40=40MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.20=20MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_funhouse_esp32s2.menu.CPUFreq.10=10MHz
adafruit_funhouse_esp32s2.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_funhouse_esp32s2.menu.FlashMode.qio=QIO
adafruit_funhouse_esp32s2.menu.FlashMode.qio.build.flash_mode=dio
adafruit_funhouse_esp32s2.menu.FlashMode.qio.build.boot=qio
adafruit_funhouse_esp32s2.menu.FlashMode.dio=DIO
adafruit_funhouse_esp32s2.menu.FlashMode.dio.build.flash_mode=dio
adafruit_funhouse_esp32s2.menu.FlashMode.dio.build.boot=dio
adafruit_funhouse_esp32s2.menu.FlashMode.qout=QOUT
adafruit_funhouse_esp32s2.menu.FlashMode.qout.build.flash_mode=dout
adafruit_funhouse_esp32s2.menu.FlashMode.qout.build.boot=qout
adafruit_funhouse_esp32s2.menu.FlashMode.dout=DOUT
adafruit_funhouse_esp32s2.menu.FlashMode.dout.build.flash_mode=dout
adafruit_funhouse_esp32s2.menu.FlashMode.dout.build.boot=dout

adafruit_funhouse_esp32s2.menu.FlashFreq.80=80MHz
adafruit_funhouse_esp32s2.menu.FlashFreq.80.build.flash_freq=80m
adafruit_funhouse_esp32s2.menu.FlashFreq.40=40MHz
adafruit_funhouse_esp32s2.menu.FlashFreq.40.build.flash_freq=40m

adafruit_funhouse_esp32s2.menu.FlashSize.4M=4MB (32Mb)
adafruit_funhouse_esp32s2.menu.FlashSize.4M.build.flash_size=4MB
adafruit_funhouse_esp32s2.menu.FlashSize.8M=8MB (64Mb)
adafruit_funhouse_esp32s2.menu.FlashSize.8M.build.flash_size=8MB
adafruit_funhouse_esp32s2.menu.FlashSize.8M.build.partitions=default_8MB
adafruit_funhouse_esp32s2.menu.FlashSize.2M=2MB (16Mb)
adafruit_funhouse_esp32s2.menu.FlashSize.2M.build.flash_size=2MB
adafruit_funhouse_esp32s2.menu.FlashSize.2M.build.partitions=minimal
adafruit_funhouse_esp32s2.menu.FlashSize.16M=16MB (128Mb)
adafruit_funhouse_esp32s2.menu.FlashSize.16M.build.flash_size=16MB

adafruit_funhouse_esp32s2.menu.UploadSpeed.921600=921600
adafruit_funhouse_esp32s2.menu.UploadSpeed.921600.upload.speed=921600
adafruit_funhouse_esp32s2.menu.UploadSpeed.115200=115200
adafruit_funhouse_esp32s2.menu.UploadSpeed.115200.upload.speed=115200
adafruit_funhouse_esp32s2.menu.UploadSpeed.256000.windows=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.256000.upload.speed=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400=230400
adafruit_funhouse_esp32s2.menu.UploadSpeed.230400.upload.speed=230400
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.linux=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.macosx=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.460800.upload.speed=460800
adafruit_funhouse_esp32s2.menu.UploadSpeed.512000.windows=512000
adafruit_funhouse_esp32s2.menu.UploadSpeed.512000.upload.speed=512000

adafruit_funhouse_esp32s2.menu.DebugLevel.none=None
adafruit_funhouse_esp32s2.menu.DebugLevel.none.build.code_debug=0
adafruit_funhouse_esp32s2.menu.DebugLevel.error=Error
adafruit_funhouse_esp32s2.menu.DebugLevel.error.build.code_debug=1
adafruit_funhouse_esp32s2.menu.DebugLevel.warn=Warn
adafruit_funhouse_esp32s2.menu.DebugLevel.warn.build.code_debug=2
adafruit_funhouse_esp32s2.menu.DebugLevel.info=Info
adafruit_funhouse_esp32s2.menu.DebugLevel.info.build.code_debug=3
adafruit_funhouse_esp32s2.menu.DebugLevel.debug=Debug
adafruit_funhouse_esp32s2.menu.DebugLevel.debug.build.code_debug=4
adafruit_funhouse_esp32s2.menu.DebugLevel.verbose=Verbose
adafruit_funhouse_esp32s2.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

adafruit_feather_esp32s2.name=Adafruit Feather ESP32-S2
adafruit_feather_esp32s2.vid.0=0x239A
adafruit_feather_esp32s2.pid.0=0x80EB
adafruit_feather_esp32s2.vid.1=0x239A
adafruit_feather_esp32s2.pid.1=0x00EB
adafruit_feather_esp32s2.vid.1=0x239A
adafruit_feather_esp32s2.pid.1=0x80EC

adafruit_feather_esp32s2.upload.tool=esptool_py
adafruit_feather_esp32s2.upload.maximum_size=1310720
adafruit_feather_esp32s2.upload.maximum_data_size=327680
adafruit_feather_esp32s2.upload.flags=
adafruit_feather_esp32s2.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_feather_esp32s2.upload.use_1200bps_touch=true
adafruit_feather_esp32s2.upload.wait_for_upload_port=true

adafruit_feather_esp32s2.serial.disableDTR=false
adafruit_feather_esp32s2.serial.disableRTS=false

adafruit_feather_esp32s2.build.tarch=xtensa
adafruit_feather_esp32s2.build.bootloader_addr=0x1000
adafruit_feather_esp32s2.build.target=esp32s2
adafruit_feather_esp32s2.build.mcu=esp32s2
adafruit_feather_esp32s2.build.core=esp32
adafruit_feather_esp32s2.build.variant=adafruit_feather_esp32s2
adafruit_feather_esp32s2.build.board=ADAFRUIT_FEATHER_ESP32S2

adafruit_feather_esp32s2.build.cdc_on_boot=1
adafruit_feather_esp32s2.build.msc_on_boot=0
adafruit_feather_esp32s2.build.dfu_on_boot=0
adafruit_feather_esp32s2.build.f_cpu=240000000L
adafruit_feather_esp32s2.build.flash_size=4MB
adafruit_feather_esp32s2.build.flash_freq=80m
adafruit_feather_esp32s2.build.flash_mode=qio
adafruit_feather_esp32s2.build.boot=qio
adafruit_feather_esp32s2.build.partitions=default
adafruit_feather_esp32s2.build.defines=

adafruit_feather_esp32s2.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s2.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s2.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s2.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s2.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s2.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s2.menu.MSCOnBoot.msc=Enabled
adafruit_feather_esp32s2.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s2.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s2.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s2.menu.DFUOnBoot.dfu=Enabled
adafruit_feather_esp32s2.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s2.menu.UploadMode.cdc=Internal USB
adafruit_feather_esp32s2.menu.UploadMode.cdc.upload.use_1200bps_touch=true
adafruit_feather_esp32s2.menu.UploadMode.cdc.upload.wait_for_upload_port=true
adafruit_feather_esp32s2.menu.UploadMode.default=UART0
adafruit_feather_esp32s2.menu.UploadMode.default.upload.use_1200bps_touch=false
adafruit_feather_esp32s2.menu.UploadMode.default.upload.wait_for_upload_port=false

adafruit_feather_esp32s2.menu.PSRAM.enabled=Enabled
adafruit_feather_esp32s2.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s2.menu.PSRAM.disabled=Disabled
adafruit_feather_esp32s2.menu.PSRAM.disabled.build.defines=

