espressif/arduino-esp32/boards.txt
##############################################################

adafruit_feather_esp32s2_tft.name=Adafruit Feather ESP32-S2 TFT
adafruit_feather_esp32s2_tft.vid.0=0x239A
adafruit_feather_esp32s2_tft.pid.0=0x810F
adafruit_feather_esp32s2_tft.vid.1=0x239A
adafruit_feather_esp32s2_tft.pid.1=0x010F
adafruit_feather_esp32s2_tft.vid.1=0x239A
adafruit_feather_esp32s2_tft.pid.1=0x8110

adafruit_feather_esp32s2_tft.upload.tool=esptool_py
adafruit_feather_esp32s2_tft.upload.maximum_size=1310720
adafruit_feather_esp32s2_tft.upload.maximum_data_size=327680
adafruit_feather_esp32s2_tft.upload.flags=
adafruit_feather_esp32s2_tft.upload.extra_flags=0x2d0000 "{runtime.platform.path}/variants/{build.variant}/tinyuf2.bin"
adafruit_feather_esp32s2_tft.upload.use_1200bps_touch=true
adafruit_feather_esp32s2_tft.upload.wait_for_upload_port=true

adafruit_feather_esp32s2_tft.serial.disableDTR=false
adafruit_feather_esp32s2_tft.serial.disableRTS=false

adafruit_feather_esp32s2_tft.build.tarch=xtensa
adafruit_feather_esp32s2_tft.build.bootloader_addr=0x1000
adafruit_feather_esp32s2_tft.build.target=esp32s2
adafruit_feather_esp32s2_tft.build.mcu=esp32s2
adafruit_feather_esp32s2_tft.build.core=esp32
adafruit_feather_esp32s2_tft.build.variant=adafruit_feather_esp32s2_tft
adafruit_feather_esp32s2_tft.build.board=ADAFRUIT_FEATHER_ESP32S2_TFT

adafruit_feather_esp32s2_tft.build.cdc_on_boot=0
adafruit_feather_esp32s2_tft.build.msc_on_boot=0
adafruit_feather_esp32s2_tft.build.dfu_on_boot=0
adafruit_feather_esp32s2_tft.build.f_cpu=240000000L
adafruit_feather_esp32s2_tft.build.flash_size=4MB
adafruit_feather_esp32s2_tft.build.flash_freq=80m
adafruit_feather_esp32s2_tft.build.flash_mode=qio
adafruit_feather_esp32s2_tft.build.boot=qio
adafruit_feather_esp32s2_tft.build.partitions=default
adafruit_feather_esp32s2_tft.build.defines=

adafruit_feather_esp32s2_tft.menu.CDCOnBoot.cdc=Enabled
adafruit_feather_esp32s2_tft.menu.CDCOnBoot.cdc.build.cdc_on_boot=1
adafruit_feather_esp32s2_tft.menu.CDCOnBoot.default=Disabled
adafruit_feather_esp32s2_tft.menu.CDCOnBoot.default.build.cdc_on_boot=0

adafruit_feather_esp32s2_tft.menu.MSCOnBoot.default=Disabled
adafruit_feather_esp32s2_tft.menu.MSCOnBoot.default.build.msc_on_boot=0
adafruit_feather_esp32s2_tft.menu.MSCOnBoot.msc=Enabled
adafruit_feather_esp32s2_tft.menu.MSCOnBoot.msc.build.msc_on_boot=1

adafruit_feather_esp32s2_tft.menu.DFUOnBoot.default=Disabled
adafruit_feather_esp32s2_tft.menu.DFUOnBoot.default.build.dfu_on_boot=0
adafruit_feather_esp32s2_tft.menu.DFUOnBoot.dfu=Enabled
adafruit_feather_esp32s2_tft.menu.DFUOnBoot.dfu.build.dfu_on_boot=1

adafruit_feather_esp32s2_tft.menu.PSRAM.enabled=Enabled
adafruit_feather_esp32s2_tft.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM
adafruit_feather_esp32s2_tft.menu.PSRAM.disabled=Disabled
adafruit_feather_esp32s2_tft.menu.PSRAM.disabled.build.defines=

adafruit_feather_esp32s2_tft.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.default.build.partitions=default
adafruit_feather_esp32s2_tft.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
adafruit_feather_esp32s2_tft.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
adafruit_feather_esp32s2_tft.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
adafruit_feather_esp32s2_tft.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.minimal.build.partitions=minimal
adafruit_feather_esp32s2_tft.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_feather_esp32s2_tft.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
adafruit_feather_esp32s2_tft.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
adafruit_feather_esp32s2_tft.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.huge_app.build.partitions=huge_app
adafruit_feather_esp32s2_tft.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
adafruit_feather_esp32s2_tft.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_feather_esp32s2_tft.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
adafruit_feather_esp32s2_tft.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.fatflash.build.partitions=ffat
adafruit_feather_esp32s2_tft.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
adafruit_feather_esp32s2_tft.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
adafruit_feather_esp32s2_tft.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
adafruit_feather_esp32s2_tft.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728

adafruit_feather_esp32s2_tft.menu.CPUFreq.240=240MHz (WiFi)
adafruit_feather_esp32s2_tft.menu.CPUFreq.240.build.f_cpu=240000000L
adafruit_feather_esp32s2_tft.menu.CPUFreq.160=160MHz (WiFi)
adafruit_feather_esp32s2_tft.menu.CPUFreq.160.build.f_cpu=160000000L
adafruit_feather_esp32s2_tft.menu.CPUFreq.80=80MHz (WiFi)
adafruit_feather_esp32s2_tft.menu.CPUFreq.80.build.f_cpu=80000000L
adafruit_feather_esp32s2_tft.menu.CPUFreq.40=40MHz
adafruit_feather_esp32s2_tft.menu.CPUFreq.40.build.f_cpu=40000000L
adafruit_feather_esp32s2_tft.menu.CPUFreq.20=20MHz
adafruit_feather_esp32s2_tft.menu.CPUFreq.20.build.f_cpu=20000000L
adafruit_feather_esp32s2_tft.menu.CPUFreq.10=10MHz
adafruit_feather_esp32s2_tft.menu.CPUFreq.10.build.f_cpu=10000000L

adafruit_feather_esp32s2_tft.menu.FlashMode.qio=QIO
adafruit_feather_esp32s2_tft.menu.FlashMode.qio.build.flash_mode=dio
adafruit_feather_esp32s2_tft.menu.FlashMode.qio.build.boot=qio
adafruit_feather_esp32s2_tft.menu.FlashMode.dio=DIO
adafruit_feather_esp32s2_tft.menu.FlashMode.dio.build.flash_mode=dio
adafruit_feather_esp32s2_tft.menu.FlashMode.dio.build.boot=dio
adafruit_feather_esp32s2_tft.menu.FlashMode.qout=QOUT
adafruit_feather_esp32s2_tft.menu.FlashMode.qout.build.flash_mode=dout
adafruit_feather_esp32s2_tft.menu.FlashMode.qout.build.boot=qout
adafruit_feather_esp32s2_tft.menu.FlashMode.dout=DOUT
adafruit_feather_esp32s2_tft.menu.FlashMode.dout.build.flash_mode=dout
adafruit_feather_esp32s2_tft.menu.FlashMode.dout.build.boot=dout

adafruit_feather_esp32s2_tft.menu.FlashFreq.80=80MHz
adafruit_feather_esp32s2_tft.menu.FlashFreq.80.build.flash_freq=80m
adafruit_feather_esp32s2_tft.menu.FlashFreq.40=40MHz
adafruit_feather_esp32s2_tft.menu.FlashFreq.40.build.flash_freq=40m

