espressif/arduino-esp32/boards.txt
adafruit_qtpy_esp32c3.menu.FlashSize.4M=4MB (32Mb)
adafruit_qtpy_esp32c3.menu.FlashSize.4M.build.flash_size=4MB
adafruit_qtpy_esp32c3.menu.FlashSize.2M=2MB (16Mb)
adafruit_qtpy_esp32c3.menu.FlashSize.2M.build.flash_size=2MB
adafruit_qtpy_esp32c3.menu.FlashSize.2M.build.partitions=minimal

adafruit_qtpy_esp32c3.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32c3.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32c3.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32c3.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32c3.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32c3.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32c3.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32c3.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32c3.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32c3.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32c3.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32c3.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32c3.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32c3.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32c3.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32c3.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32c3.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32c3.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32c3.menu.DebugLevel.none=None
adafruit_qtpy_esp32c3.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32c3.menu.DebugLevel.error=Error
adafruit_qtpy_esp32c3.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32c3.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32c3.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32c3.menu.DebugLevel.info=Info
adafruit_qtpy_esp32c3.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32c3.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32c3.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32c3.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32c3.menu.DebugLevel.verbose.build.code_debug=5


adafruit_qtpy_esp32_pico.name=Adafruit QT Py ESP32

adafruit_qtpy_esp32_pico.upload.tool=esptool_py
adafruit_qtpy_esp32_pico.upload.maximum_size=1310720
adafruit_qtpy_esp32_pico.upload.maximum_data_size=327680
adafruit_qtpy_esp32_pico.upload.flags=
adafruit_qtpy_esp32_pico.upload.extra_flags=

adafruit_qtpy_esp32_pico.serial.disableDTR=true
adafruit_qtpy_esp32_pico.serial.disableRTS=true

adafruit_qtpy_esp32_pico.build.tarch=xtensa
adafruit_qtpy_esp32_pico.build.bootloader_addr=0x1000
adafruit_qtpy_esp32_pico.build.target=esp32
adafruit_qtpy_esp32_pico.build.mcu=esp32
adafruit_qtpy_esp32_pico.build.core=esp32
adafruit_qtpy_esp32_pico.build.variant=adafruit_qtpy_esp32
adafruit_qtpy_esp32_pico.build.board=ADAFRUIT_QTPY_ESP32_PICO

adafruit_qtpy_esp32_pico.build.f_cpu=240000000L
adafruit_qtpy_esp32_pico.build.flash_size=8MB
adafruit_qtpy_esp32_pico.build.flash_freq=80m
adafruit_qtpy_esp32_pico.build.flash_mode=dio
adafruit_qtpy_esp32_pico.build.boot=dio
adafruit_qtpy_esp32_pico.build.partitions=default
adafruit_qtpy_esp32_pico.build.defines=

adafruit_qtpy_esp32_pico.menu.PartitionScheme.default=Default
adafruit_qtpy_esp32_pico.menu.PartitionScheme.default.build.partitions=default
adafruit_qtpy_esp32_pico.menu.PartitionScheme.no_ota=No OTA (Large APP)
adafruit_qtpy_esp32_pico.menu.PartitionScheme.no_ota.build.partitions=no_ota
adafruit_qtpy_esp32_pico.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
adafruit_qtpy_esp32_pico.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
adafruit_qtpy_esp32_pico.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
adafruit_qtpy_esp32_pico.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.921600.upload.speed=921600
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.115200.upload.speed=115200
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.windows=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.256000.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.windows.upload.speed=256000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.230400.upload.speed=230400
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.linux=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.macosx=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.460800.upload.speed=460800
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.windows=512000
adafruit_qtpy_esp32_pico.menu.UploadSpeed.512000.upload.speed=512000

adafruit_qtpy_esp32_pico.menu.PSRAM.enabled=Enabled
adafruit_qtpy_esp32_pico.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
adafruit_qtpy_esp32_pico.menu.PSRAM.enabled.build.extra_libs=
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled=Disabled
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled.build.defines=
adafruit_qtpy_esp32_pico.menu.PSRAM.disabled.build.extra_libs=

adafruit_qtpy_esp32_pico.menu.DebugLevel.none=None
adafruit_qtpy_esp32_pico.menu.DebugLevel.none.build.code_debug=0
adafruit_qtpy_esp32_pico.menu.DebugLevel.error=Error
adafruit_qtpy_esp32_pico.menu.DebugLevel.error.build.code_debug=1
adafruit_qtpy_esp32_pico.menu.DebugLevel.warn=Warn
adafruit_qtpy_esp32_pico.menu.DebugLevel.warn.build.code_debug=2
adafruit_qtpy_esp32_pico.menu.DebugLevel.info=Info
adafruit_qtpy_esp32_pico.menu.DebugLevel.info.build.code_debug=3
adafruit_qtpy_esp32_pico.menu.DebugLevel.debug=Debug
adafruit_qtpy_esp32_pico.menu.DebugLevel.debug.build.code_debug=4
adafruit_qtpy_esp32_pico.menu.DebugLevel.verbose=Verbose
adafruit_qtpy_esp32_pico.menu.DebugLevel.verbose.build.code_debug=5



adafruit_feather_esp32_v2.name=Adafruit Feather ESP32 V2

adafruit_feather_esp32_v2.upload.tool=esptool_py
adafruit_feather_esp32_v2.upload.maximum_size=1310720
adafruit_feather_esp32_v2.upload.maximum_data_size=327680
adafruit_feather_esp32_v2.upload.flags=
adafruit_feather_esp32_v2.upload.extra_flags=

adafruit_feather_esp32_v2.serial.disableDTR=true
adafruit_feather_esp32_v2.serial.disableRTS=true

adafruit_feather_esp32_v2.build.tarch=xtensa
adafruit_feather_esp32_v2.build.bootloader_addr=0x1000
adafruit_feather_esp32_v2.build.target=esp32
adafruit_feather_esp32_v2.build.mcu=esp32
adafruit_feather_esp32_v2.build.core=esp32
adafruit_feather_esp32_v2.build.variant=adafruit_feather_esp32_v2
adafruit_feather_esp32_v2.build.board=ADAFRUIT_FEATHER_ESP32_V2

