espressif/arduino-esp32/boards.txt
bpi-bit.upload.tool=esptool_py
bpi-bit.upload.maximum_size=1310720
bpi-bit.upload.maximum_data_size=294912
bpi-bit.upload.flags=
bpi-bit.upload.extra_flags=

bpi-bit.serial.disableDTR=true
bpi-bit.serial.disableRTS=true

bpi-bit.build.tarch=xtensa
bpi-bit.build.bootloader_addr=0x1000
bpi-bit.build.target=esp32
bpi-bit.build.mcu=esp32
bpi-bit.build.core=esp32
bpi-bit.build.variant=bpi-bit
bpi-bit.build.board=BPI_BIT

bpi-bit.build.f_cpu=160000000L
bpi-bit.build.flash_mode=dio
bpi-bit.build.flash_size=4MB
bpi-bit.build.boot=dio
bpi-bit.build.partitions=default

bpi-bit.menu.FlashFreq.80=80MHz
bpi-bit.menu.FlashFreq.80.build.flash_freq=80m
bpi-bit.menu.FlashFreq.40=40MHz
bpi-bit.menu.FlashFreq.40.build.flash_freq=40m

bpi-bit.menu.UploadSpeed.921600=921600
bpi-bit.menu.UploadSpeed.921600.upload.speed=921600
bpi-bit.menu.UploadSpeed.115200=115200
bpi-bit.menu.UploadSpeed.115200.upload.speed=115200
bpi-bit.menu.UploadSpeed.256000.windows=256000
bpi-bit.menu.UploadSpeed.256000.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400.windows.upload.speed=256000
bpi-bit.menu.UploadSpeed.230400=230400
bpi-bit.menu.UploadSpeed.230400.upload.speed=230400
bpi-bit.menu.UploadSpeed.460800.linux=460800
bpi-bit.menu.UploadSpeed.460800.macosx=460800
bpi-bit.menu.UploadSpeed.460800.upload.speed=460800
bpi-bit.menu.UploadSpeed.512000.windows=512000
bpi-bit.menu.UploadSpeed.512000.upload.speed=512000

bpi-bit.menu.DebugLevel.none=None
bpi-bit.menu.DebugLevel.none.build.code_debug=0
bpi-bit.menu.DebugLevel.error=Error
bpi-bit.menu.DebugLevel.error.build.code_debug=1
bpi-bit.menu.DebugLevel.warn=Warn
bpi-bit.menu.DebugLevel.warn.build.code_debug=2
bpi-bit.menu.DebugLevel.info=Info
bpi-bit.menu.DebugLevel.info.build.code_debug=3
bpi-bit.menu.DebugLevel.debug=Debug
bpi-bit.menu.DebugLevel.debug.build.code_debug=4
bpi-bit.menu.DebugLevel.verbose=Verbose
bpi-bit.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

wesp32.name=Silicognition wESP32

wesp32.upload.tool=esptool_py
wesp32.upload.maximum_size=1310720
wesp32.upload.maximum_data_size=327680
wesp32.upload.flags=
wesp32.upload.extra_flags=

wesp32.serial.disableDTR=true
wesp32.serial.disableRTS=true

wesp32.build.tarch=xtensa
wesp32.build.bootloader_addr=0x1000
wesp32.build.target=esp32
wesp32.build.mcu=esp32
wesp32.build.core=esp32
wesp32.build.variant=wesp32
wesp32.build.board=WESP32

wesp32.build.f_cpu=240000000L
wesp32.build.flash_mode=dio
wesp32.build.flash_size=4MB
wesp32.build.boot=dio
wesp32.build.partitions=default
wesp32.build.defines=

wesp32.menu.FlashFreq.80=80MHz
wesp32.menu.FlashFreq.80.build.flash_freq=80m
wesp32.menu.FlashFreq.40=40MHz
wesp32.menu.FlashFreq.40.build.flash_freq=40m

wesp32.menu.UploadSpeed.921600=921600
wesp32.menu.UploadSpeed.921600.upload.speed=921600
wesp32.menu.UploadSpeed.115200=115200
wesp32.menu.UploadSpeed.115200.upload.speed=115200
wesp32.menu.UploadSpeed.256000.windows=256000
wesp32.menu.UploadSpeed.256000.upload.speed=256000
wesp32.menu.UploadSpeed.230400.windows.upload.speed=256000
wesp32.menu.UploadSpeed.230400=230400
wesp32.menu.UploadSpeed.230400.upload.speed=230400
wesp32.menu.UploadSpeed.460800.linux=460800
wesp32.menu.UploadSpeed.460800.macosx=460800
wesp32.menu.UploadSpeed.460800.upload.speed=460800
wesp32.menu.UploadSpeed.512000.windows=512000
wesp32.menu.UploadSpeed.512000.upload.speed=512000

wesp32.menu.DebugLevel.none=None
wesp32.menu.DebugLevel.none.build.code_debug=0
wesp32.menu.DebugLevel.error=Error
wesp32.menu.DebugLevel.error.build.code_debug=1
wesp32.menu.DebugLevel.warn=Warn
wesp32.menu.DebugLevel.warn.build.code_debug=2
wesp32.menu.DebugLevel.info=Info
wesp32.menu.DebugLevel.info.build.code_debug=3
wesp32.menu.DebugLevel.debug=Debug
wesp32.menu.DebugLevel.debug.build.code_debug=4
wesp32.menu.DebugLevel.verbose=Verbose
wesp32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

t-beam.name=T-Beam

t-beam.upload.tool=esptool_py
t-beam.upload.maximum_size=1310720
t-beam.upload.maximum_data_size=327680
t-beam.upload.flags=
t-beam.upload.extra_flags=

t-beam.serial.disableDTR=true
t-beam.serial.disableRTS=true

t-beam.build.tarch=xtensa
t-beam.build.bootloader_addr=0x1000
t-beam.build.target=esp32
t-beam.build.mcu=esp32
t-beam.build.core=esp32
t-beam.build.variant=tbeam
t-beam.build.board=TBeam

t-beam.build.f_cpu=240000000L
t-beam.build.flash_mode=dio
t-beam.build.flash_size=4MB
t-beam.build.boot=dio
t-beam.build.partitions=default

t-beam.menu.PSRAM.disabled=Disabled
t-beam.menu.PSRAM.disabled.build.defines=
t-beam.menu.PSRAM.disabled.build.extra_libs=
t-beam.menu.PSRAM.enabled=Enabled
t-beam.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
t-beam.menu.PSRAM.enabled.build.extra_libs=

t-beam.menu.FlashFreq.80=80MHz
t-beam.menu.FlashFreq.80.build.flash_freq=80m
t-beam.menu.FlashFreq.40=40MHz
t-beam.menu.FlashFreq.40.build.flash_freq=40m

t-beam.menu.UploadSpeed.921600=921600
t-beam.menu.UploadSpeed.921600.upload.speed=921600
t-beam.menu.UploadSpeed.115200=115200
t-beam.menu.UploadSpeed.115200.upload.speed=115200
t-beam.menu.UploadSpeed.256000.windows=256000
t-beam.menu.UploadSpeed.256000.upload.speed=256000
t-beam.menu.UploadSpeed.230400.windows.upload.speed=256000
t-beam.menu.UploadSpeed.230400=230400
t-beam.menu.UploadSpeed.230400.upload.speed=230400
t-beam.menu.UploadSpeed.460800.linux=460800
t-beam.menu.UploadSpeed.460800.macosx=460800
t-beam.menu.UploadSpeed.460800.upload.speed=460800
t-beam.menu.UploadSpeed.512000.windows=512000
t-beam.menu.UploadSpeed.512000.upload.speed=512000

t-beam.menu.DebugLevel.none=None
t-beam.menu.DebugLevel.none.build.code_debug=0
t-beam.menu.DebugLevel.error=Error
t-beam.menu.DebugLevel.error.build.code_debug=1
t-beam.menu.DebugLevel.warn=Warn
t-beam.menu.DebugLevel.warn.build.code_debug=2
t-beam.menu.DebugLevel.info=Info
t-beam.menu.DebugLevel.info.build.code_debug=3
t-beam.menu.DebugLevel.debug=Debug
t-beam.menu.DebugLevel.debug.build.code_debug=4
t-beam.menu.DebugLevel.verbose=Verbose
t-beam.menu.DebugLevel.verbose.build.code_debug=5

