espressif/arduino-esp32/boards.txt
##############################################################

esp32cam.name=AI Thinker ESP32-CAM

esp32cam.upload.tool=esptool_py
esp32cam.upload.maximum_size=3145728
esp32cam.upload.maximum_data_size=327680
esp32cam.upload.flags=
esp32cam.upload.extra_flags=
esp32cam.upload.speed=460800

esp32cam.serial.disableDTR=true
esp32cam.serial.disableRTS=true

esp32cam.build.tarch=xtensa
esp32cam.build.bootloader_addr=0x1000
esp32cam.build.target=esp32
esp32cam.build.mcu=esp32
esp32cam.build.core=esp32
esp32cam.build.variant=esp32
esp32cam.build.board=ESP32_DEV
esp32cam.build.flash_size=4MB
esp32cam.build.partitions=huge_app
esp32cam.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
esp32cam.build.extra_libs=
esp32cam.build.code_debug=0

esp32cam.menu.CPUFreq.240=240MHz (WiFi/BT)
esp32cam.menu.CPUFreq.240.build.f_cpu=240000000L
esp32cam.menu.CPUFreq.160=160MHz (WiFi/BT)
esp32cam.menu.CPUFreq.160.build.f_cpu=160000000L
esp32cam.menu.CPUFreq.80=80MHz (WiFi/BT)
esp32cam.menu.CPUFreq.80.build.f_cpu=80000000L
esp32cam.menu.CPUFreq.40=40MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.40.build.f_cpu=40000000L
esp32cam.menu.CPUFreq.26=26MHz (26MHz XTAL)
esp32cam.menu.CPUFreq.26.build.f_cpu=26000000L
esp32cam.menu.CPUFreq.20=20MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.20.build.f_cpu=20000000L
esp32cam.menu.CPUFreq.13=13MHz (26MHz XTAL)
esp32cam.menu.CPUFreq.13.build.f_cpu=13000000L
esp32cam.menu.CPUFreq.10=10MHz (40MHz XTAL)
esp32cam.menu.CPUFreq.10.build.f_cpu=10000000L

esp32cam.menu.FlashMode.qio=QIO
esp32cam.menu.FlashMode.qio.build.flash_mode=dio
esp32cam.menu.FlashMode.qio.build.boot=qio
esp32cam.menu.FlashMode.dio=DIO
esp32cam.menu.FlashMode.dio.build.flash_mode=dio
esp32cam.menu.FlashMode.dio.build.boot=dio
esp32cam.menu.FlashMode.qout=QOUT
esp32cam.menu.FlashMode.qout.build.flash_mode=dout
esp32cam.menu.FlashMode.qout.build.boot=qout
esp32cam.menu.FlashMode.dout=DOUT
esp32cam.menu.FlashMode.dout.build.flash_mode=dout
esp32cam.menu.FlashMode.dout.build.boot=dout

esp32cam.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
esp32cam.menu.PartitionScheme.huge_app.build.partitions=huge_app
esp32cam.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
esp32cam.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
esp32cam.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
esp32cam.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
esp32cam.menu.PartitionScheme.default=Regular 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
esp32cam.menu.PartitionScheme.default.build.partitions=default
esp32cam.menu.PartitionScheme.defaultffat=Regular 4MB with ffat (1.2MB APP/1.5MB FATFS)
esp32cam.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
esp32cam.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
esp32cam.menu.PartitionScheme.minimal.build.partitions=minimal
esp32cam.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
esp32cam.menu.PartitionScheme.no_ota.build.partitions=no_ota
esp32cam.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
esp32cam.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
esp32cam.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
esp32cam.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
esp32cam.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
esp32cam.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
esp32cam.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
esp32cam.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
esp32cam.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
esp32cam.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576

esp32cam.menu.FlashFreq.80=80MHz
esp32cam.menu.FlashFreq.80.build.flash_freq=80m
esp32cam.menu.FlashFreq.40=40MHz
esp32cam.menu.FlashFreq.40.build.flash_freq=40m

esp32cam.menu.DebugLevel.none=None
esp32cam.menu.DebugLevel.none.build.code_debug=0
esp32cam.menu.DebugLevel.error=Error
esp32cam.menu.DebugLevel.error.build.code_debug=1
esp32cam.menu.DebugLevel.warn=Warn
esp32cam.menu.DebugLevel.warn.build.code_debug=2
esp32cam.menu.DebugLevel.info=Info
esp32cam.menu.DebugLevel.info.build.code_debug=3
esp32cam.menu.DebugLevel.debug=Debug
esp32cam.menu.DebugLevel.debug.build.code_debug=4
esp32cam.menu.DebugLevel.verbose=Verbose
esp32cam.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

twatch.name=TTGO T-Watch

twatch.upload.tool=esptool_py
twatch.upload.maximum_size=6553600
twatch.upload.maximum_data_size=4521984
twatch.upload.wait_for_upload_port=true
twatch.upload.flags=
twatch.upload.extra_flags=

twatch.serial.disableDTR=true
twatch.serial.disableRTS=true

twatch.build.tarch=xtensa
twatch.build.bootloader_addr=0x1000
twatch.build.target=esp32
twatch.build.mcu=esp32
twatch.build.core=esp32
twatch.build.variant=twatch
twatch.build.board=TWatch

twatch.menu.Revision.TWATCH_BASE=T-Watch Base
twatch.menu.Revision.TWATCH_BASE.build.board=TWATCH_BASE
twatch.menu.Revision.TWATCH_2020_V1=T-Watch-2020-V1
twatch.menu.Revision.TWATCH_2020_V1.build.board=TWATCH_2020_V1
twatch.menu.Revision.TWATCH_2020_V2=T-Watch-2020-V2
twatch.menu.Revision.TWATCH_2020_V2.build.board=TWATCH_2020_V2
twatch.menu.Revision.TWATCH_2020_V3=T-Watch-2020-V3
twatch.menu.Revision.TWATCH_2020_V3.build.board=TWATCH_2020_V3

twatch.build.f_cpu=240000000L
twatch.build.flash_size=16MB
twatch.build.flash_freq=80m
twatch.build.flash_mode=dio
twatch.build.boot=dio
twatch.build.partitions=default_16MB
twatch.build.defines=

twatch.menu.PSRAM.enabled=Enabled
twatch.menu.PSRAM.enabled.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
twatch.menu.PSRAM.enabled.build.extra_libs=
twatch.menu.PSRAM.disabled=Disabled
twatch.menu.PSRAM.disabled.build.defines=
twatch.menu.PSRAM.disabled.build.extra_libs=

twatch.menu.PartitionScheme.default=Default (2 x 6.5 MB app, 3.6 MB SPIFFS)
twatch.menu.PartitionScheme.default.build.partitions=default_16MB
twatch.menu.PartitionScheme.default.upload.maximum_size=6553600
twatch.menu.PartitionScheme.large_spiffs=Large SPIFFS (7 MB)
twatch.menu.PartitionScheme.large_spiffs.build.partitions=large_spiffs_16MB
twatch.menu.PartitionScheme.large_spiffs.upload.maximum_size=4685824

twatch.menu.UploadSpeed.2000000=2000000
twatch.menu.UploadSpeed.2000000.upload.speed=2000000
twatch.menu.UploadSpeed.1152000=1152000
twatch.menu.UploadSpeed.1152000.upload.speed=1152000
twatch.menu.UploadSpeed.921600=921600
twatch.menu.UploadSpeed.921600.upload.speed=921600
twatch.menu.UploadSpeed.115200=115200
twatch.menu.UploadSpeed.115200.upload.speed=115200
twatch.menu.UploadSpeed.256000.windows=256000
twatch.menu.UploadSpeed.256000.upload.speed=256000
twatch.menu.UploadSpeed.230400.windows.upload.speed=256000
twatch.menu.UploadSpeed.230400=230400
twatch.menu.UploadSpeed.230400.upload.speed=230400
twatch.menu.UploadSpeed.460800.linux=460800
twatch.menu.UploadSpeed.460800.macosx=460800
twatch.menu.UploadSpeed.460800.upload.speed=460800
twatch.menu.UploadSpeed.512000.windows=512000
twatch.menu.UploadSpeed.512000.upload.speed=512000

twatch.menu.DebugLevel.none=None
twatch.menu.DebugLevel.none.build.code_debug=0
twatch.menu.DebugLevel.error=Error
twatch.menu.DebugLevel.error.build.code_debug=1
twatch.menu.DebugLevel.warn=Warn
twatch.menu.DebugLevel.warn.build.code_debug=2
twatch.menu.DebugLevel.info=Info
twatch.menu.DebugLevel.info.build.code_debug=3
twatch.menu.DebugLevel.debug=Debug
twatch.menu.DebugLevel.debug.build.code_debug=4
twatch.menu.DebugLevel.verbose=Verbose
twatch.menu.DebugLevel.verbose.build.code_debug=5

