espressif/arduino-esp32/boards.txt
##############################################################

OpenKB.name=INEX OpenKB

OpenKB.upload.tool=esptool_py
OpenKB.upload.maximum_size=1310720
OpenKB.upload.maximum_data_size=327680
OpenKB.upload.wait_for_upload_port=true
OpenKB.upload.flags=
OpenKB.upload.extra_flags=

OpenKB.serial.disableDTR=true
OpenKB.serial.disableRTS=true

OpenKB.build.tarch=xtensa
OpenKB.build.bootloader_addr=0x1000
OpenKB.build.target=esp32
OpenKB.build.mcu=esp32
OpenKB.build.core=esp32
OpenKB.build.variant=openkb
OpenKB.build.board=openkb

OpenKB.build.f_cpu=240000000L
OpenKB.build.flash_mode=dio
OpenKB.build.flash_size=4MB
OpenKB.build.boot=dio
OpenKB.build.partitions=default
OpenKB.build.defines=

OpenKB.menu.FlashFreq.80=80MHz
OpenKB.menu.FlashFreq.80.build.flash_freq=80m
OpenKB.menu.FlashFreq.40=40MHz
OpenKB.menu.FlashFreq.40.build.flash_freq=40m

OpenKB.menu.UploadSpeed.921600=921600
OpenKB.menu.UploadSpeed.921600.upload.speed=921600
OpenKB.menu.UploadSpeed.115200=115200
OpenKB.menu.UploadSpeed.115200.upload.speed=115200
OpenKB.menu.UploadSpeed.256000.windows=256000
OpenKB.menu.UploadSpeed.256000.upload.speed=256000
OpenKB.menu.UploadSpeed.230400.windows.upload.speed=256000
OpenKB.menu.UploadSpeed.230400=230400
OpenKB.menu.UploadSpeed.230400.upload.speed=230400
OpenKB.menu.UploadSpeed.460800.linux=460800
OpenKB.menu.UploadSpeed.460800.macosx=460800
OpenKB.menu.UploadSpeed.460800.upload.speed=460800
OpenKB.menu.UploadSpeed.512000.windows=512000
OpenKB.menu.UploadSpeed.512000.upload.speed=512000

OpenKB.menu.DebugLevel.none=None
OpenKB.menu.DebugLevel.none.build.code_debug=0
OpenKB.menu.DebugLevel.error=Error
OpenKB.menu.DebugLevel.error.build.code_debug=1
OpenKB.menu.DebugLevel.warn=Warn
OpenKB.menu.DebugLevel.warn.build.code_debug=2
OpenKB.menu.DebugLevel.info=Info
OpenKB.menu.DebugLevel.info.build.code_debug=3
OpenKB.menu.DebugLevel.debug=Debug
OpenKB.menu.DebugLevel.debug.build.code_debug=4
OpenKB.menu.DebugLevel.verbose=Verbose
OpenKB.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

wifiduino32.name=WiFiduino32

wifiduino32.upload.tool=esptool_py
wifiduino32.upload.maximum_size=1310720
wifiduino32.upload.maximum_data_size=327680
wifiduino32.upload.wait_for_upload_port=true
wifiduino32.upload.flags=
wifiduino32.upload.extra_flags=

wifiduino32.serial.disableDTR=true
wifiduino32.serial.disableRTS=true

wifiduino32.build.tarch=xtensa
wifiduino32.build.bootloader_addr=0x1000
wifiduino32.build.target=esp32
wifiduino32.build.mcu=esp32
wifiduino32.build.core=esp32
wifiduino32.build.variant=wifiduino32
wifiduino32.build.board=Wifiduino32

wifiduino32.build.f_cpu=240000000L
wifiduino32.build.flash_mode=dio
wifiduino32.build.flash_size=4MB
wifiduino32.build.boot=dio
wifiduino32.build.partitions=default
wifiduino32.build.defines=

wifiduino32.menu.PartitionScheme.default=Default
wifiduino32.menu.PartitionScheme.default.build.partitions=default
wifiduino32.menu.PartitionScheme.no_ota=No OTA (Large APP)
wifiduino32.menu.PartitionScheme.no_ota.build.partitions=no_ota
wifiduino32.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
wifiduino32.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
wifiduino32.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
wifiduino32.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

wifiduino32.menu.FlashFreq.80=80MHz
wifiduino32.menu.FlashFreq.80.build.flash_freq=80m
wifiduino32.menu.FlashFreq.40=40MHz
wifiduino32.menu.FlashFreq.40.build.flash_freq=40m

wifiduino32.menu.UploadSpeed.921600=921600
wifiduino32.menu.UploadSpeed.921600.upload.speed=921600
wifiduino32.menu.UploadSpeed.115200=115200
wifiduino32.menu.UploadSpeed.115200.upload.speed=115200
wifiduino32.menu.UploadSpeed.256000.windows=256000
wifiduino32.menu.UploadSpeed.256000.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400.windows.upload.speed=256000
wifiduino32.menu.UploadSpeed.230400=230400
wifiduino32.menu.UploadSpeed.230400.upload.speed=230400
wifiduino32.menu.UploadSpeed.460800.linux=460800
wifiduino32.menu.UploadSpeed.460800.macosx=460800
wifiduino32.menu.UploadSpeed.460800.upload.speed=460800
wifiduino32.menu.UploadSpeed.512000.windows=512000
wifiduino32.menu.UploadSpeed.512000.upload.speed=512000

wifiduino32.menu.DebugLevel.none=None
wifiduino32.menu.DebugLevel.none.build.code_debug=0
wifiduino32.menu.DebugLevel.error=Error
wifiduino32.menu.DebugLevel.error.build.code_debug=1
wifiduino32.menu.DebugLevel.warn=Warn
wifiduino32.menu.DebugLevel.warn.build.code_debug=2
wifiduino32.menu.DebugLevel.info=Info
wifiduino32.menu.DebugLevel.info.build.code_debug=3
wifiduino32.menu.DebugLevel.debug=Debug
wifiduino32.menu.DebugLevel.debug.build.code_debug=4
wifiduino32.menu.DebugLevel.verbose=Verbose
wifiduino32.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

imbrios-logsens-v1p1.name=IMBRIOS LOGSENS_V1P1

imbrios-logsens-v1p1.upload.tool=esptool_py
imbrios-logsens-v1p1.upload.maximum_size=1310720
imbrios-logsens-v1p1.upload.maximum_data_size=327680
imbrios-logsens-v1p1.upload.wait_for_upload_port=true
imbrios-logsens-v1p1.upload.flags=
imbrios-logsens-v1p1.upload.extra_flags=

imbrios-logsens-v1p1.serial.disableDTR=true
imbrios-logsens-v1p1.serial.disableRTS=true

imbrios-logsens-v1p1.build.tarch=xtensa
imbrios-logsens-v1p1.build.bootloader_addr=0x1000
imbrios-logsens-v1p1.build.target=esp32
imbrios-logsens-v1p1.build.mcu=esp32
imbrios-logsens-v1p1.build.core=esp32
imbrios-logsens-v1p1.build.variant=imbrios-logsens-v1p1
imbrios-logsens-v1p1.build.board=IMBRIOS_LOGSENS_V1P1

imbrios-logsens-v1p1.build.f_cpu=240000000L
imbrios-logsens-v1p1.build.flash_mode=dio
imbrios-logsens-v1p1.build.flash_size=4MB
imbrios-logsens-v1p1.build.boot=dio
imbrios-logsens-v1p1.build.partitions=default
imbrios-logsens-v1p1.build.defines=

imbrios-logsens-v1p1.menu.FlashFreq.80=80MHz
imbrios-logsens-v1p1.menu.FlashFreq.80.build.flash_freq=80m
imbrios-logsens-v1p1.menu.FlashFreq.40=40MHz
imbrios-logsens-v1p1.menu.FlashFreq.40.build.flash_freq=40m

imbrios-logsens-v1p1.menu.PartitionScheme.default=Default
imbrios-logsens-v1p1.menu.PartitionScheme.default.build.partitions=default
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota=No OTA (Large APP)
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.build.partitions=no_ota
imbrios-logsens-v1p1.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (Large APPS with OTA)
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
imbrios-logsens-v1p1.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

imbrios-logsens-v1p1.menu.CPUFreq.240=240MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.240.build.f_cpu=240000000L
imbrios-logsens-v1p1.menu.CPUFreq.160=160MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.160.build.f_cpu=160000000L
imbrios-logsens-v1p1.menu.CPUFreq.80=80MHz (WiFi/BT)
imbrios-logsens-v1p1.menu.CPUFreq.80.build.f_cpu=80000000L
imbrios-logsens-v1p1.menu.CPUFreq.40=40MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.40.build.f_cpu=40000000L
imbrios-logsens-v1p1.menu.CPUFreq.26=26MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.26.build.f_cpu=26000000L
imbrios-logsens-v1p1.menu.CPUFreq.20=20MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.20.build.f_cpu=20000000L
imbrios-logsens-v1p1.menu.CPUFreq.13=13MHz (26MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.13.build.f_cpu=13000000L
imbrios-logsens-v1p1.menu.CPUFreq.10=10MHz (40MHz XTAL)
imbrios-logsens-v1p1.menu.CPUFreq.10.build.f_cpu=10000000L

imbrios-logsens-v1p1.menu.UploadSpeed.921600=921600
imbrios-logsens-v1p1.menu.UploadSpeed.921600.upload.speed=921600
imbrios-logsens-v1p1.menu.UploadSpeed.115200=115200
imbrios-logsens-v1p1.menu.UploadSpeed.115200.upload.speed=115200
imbrios-logsens-v1p1.menu.UploadSpeed.256000.windows=256000
imbrios-logsens-v1p1.menu.UploadSpeed.256000.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400.windows.upload.speed=256000
imbrios-logsens-v1p1.menu.UploadSpeed.230400=230400
imbrios-logsens-v1p1.menu.UploadSpeed.230400.upload.speed=230400
imbrios-logsens-v1p1.menu.UploadSpeed.460800.linux=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.macosx=460800
imbrios-logsens-v1p1.menu.UploadSpeed.460800.upload.speed=460800
imbrios-logsens-v1p1.menu.UploadSpeed.512000.windows=512000
imbrios-logsens-v1p1.menu.UploadSpeed.512000.upload.speed=512000

imbrios-logsens-v1p1.menu.DebugLevel.none=None
imbrios-logsens-v1p1.menu.DebugLevel.none.build.code_debug=0
imbrios-logsens-v1p1.menu.DebugLevel.error=Error
imbrios-logsens-v1p1.menu.DebugLevel.error.build.code_debug=1
imbrios-logsens-v1p1.menu.DebugLevel.warn=Warn
imbrios-logsens-v1p1.menu.DebugLevel.warn.build.code_debug=2
imbrios-logsens-v1p1.menu.DebugLevel.info=Info
imbrios-logsens-v1p1.menu.DebugLevel.info.build.code_debug=3
imbrios-logsens-v1p1.menu.DebugLevel.debug=Debug
imbrios-logsens-v1p1.menu.DebugLevel.debug.build.code_debug=4
imbrios-logsens-v1p1.menu.DebugLevel.verbose=Verbose
imbrios-logsens-v1p1.menu.DebugLevel.verbose.build.code_debug=5

