espressif/arduino-esp32/boards.txt
lionbit.menu.FlashMode.dio=DIO
lionbit.menu.FlashMode.dio.build.flash_mode=dio
lionbit.menu.FlashMode.dio.build.boot=dio
lionbit.menu.FlashMode.qio=QIO
lionbit.menu.FlashMode.qio.build.flash_mode=dio
lionbit.menu.FlashMode.qio.build.boot=qio
lionbit.menu.FlashMode.qout=QOUT
lionbit.menu.FlashMode.qout.build.flash_mode=dout
lionbit.menu.FlashMode.qout.build.boot=qout
lionbit.menu.FlashMode.dout=DOUT
lionbit.menu.FlashMode.dout.build.flash_mode=dout
lionbit.menu.FlashMode.dout.build.boot=dout

lionbit.menu.FlashFreq.80=80MHz
lionbit.menu.FlashFreq.80.build.flash_freq=80m
lionbit.menu.FlashFreq.40=40MHz
lionbit.menu.FlashFreq.40.build.flash_freq=40m

lionbit.menu.FlashSize.4M=4MB (32Mb)
lionbit.menu.FlashSize.4M.build.flash_size=4MB
lionbit.menu.FlashSize.4M.build.partitions=default



lionbit.menu.UploadSpeed.115200=115200
lionbit.menu.UploadSpeed.115200.upload.speed=115200
lionbit.menu.UploadSpeed.256000.windows=256000
lionbit.menu.UploadSpeed.256000.upload.speed=256000
lionbit.menu.UploadSpeed.230400.windows.upload.speed=256000
lionbit.menu.UploadSpeed.230400=230400
lionbit.menu.UploadSpeed.230400.upload.speed=230400
lionbit.menu.UploadSpeed.460800.linux=460800
lionbit.menu.UploadSpeed.460800.macosx=460800
lionbit.menu.UploadSpeed.460800.upload.speed=460800


lionbit.menu.LoopCore.1=Core 1
lionbit.menu.LoopCore.1.build.loop_core=-DARDUINO_RUNNING_CORE=1
lionbit.menu.LoopCore.0=Core 0
lionbit.menu.LoopCore.0.build.loop_core=-DARDUINO_RUNNING_CORE=0

lionbit.menu.EventsCore.1=Core 1
lionbit.menu.EventsCore.1.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=1
lionbit.menu.EventsCore.0=Core 0
lionbit.menu.EventsCore.0.build.event_core=-DARDUINO_EVENT_RUNNING_CORE=0

lionbit.menu.DebugLevel.none=None
lionbit.menu.DebugLevel.none.build.code_debug=0
lionbit.menu.DebugLevel.error=Error
lionbit.menu.DebugLevel.error.build.code_debug=1
lionbit.menu.DebugLevel.warn=Warn
lionbit.menu.DebugLevel.warn.build.code_debug=2
lionbit.menu.DebugLevel.info=Info
lionbit.menu.DebugLevel.info.build.code_debug=3
lionbit.menu.DebugLevel.debug=Debug
lionbit.menu.DebugLevel.debug.build.code_debug=4
lionbit.menu.DebugLevel.verbose=Verbose
lionbit.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

watchy.name=Watchy

watchy.upload.tool=esptool_py
watchy.upload.maximum_size=1310720
watchy.upload.maximum_data_size=327680
watchy.upload.flags=
watchy.upload.extra_flags=

watchy.serial.disableDTR=true
watchy.serial.disableRTS=true

watchy.build.tarch=xtensa
watchy.build.bootloader_addr=0x1000
watchy.build.target=esp32
watchy.build.mcu=esp32
watchy.build.core=esp32
watchy.build.variant=watchy
watchy.build.board=WATCHY

watchy.build.f_cpu=240000000L
watchy.build.flash_size=4MB
watchy.build.flash_freq=80m
watchy.build.flash_mode=dio
watchy.build.boot=qio
watchy.build.partitions=min_spiffs
watchy.build.defines=

watchy.menu.Revision.v10=Watchy v1.0
watchy.menu.Revision.v10.build.board=WATCHY_V10
watchy.menu.Revision.v15=Watchy v1.5
watchy.menu.Revision.v15.build.board=WATCHY_V15
watchy.menu.Revision.v20=Watchy v2.0
watchy.menu.Revision.v20.build.board=WATCHY_V20

watchy.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
watchy.menu.PartitionScheme.huge_app.build.partitions=huge_app
watchy.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
watchy.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
watchy.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
watchy.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080

watchy.menu.UploadSpeed.921600=921600
watchy.menu.UploadSpeed.921600.upload.speed=921600
watchy.menu.UploadSpeed.115200=115200
watchy.menu.UploadSpeed.115200.upload.speed=115200
watchy.menu.UploadSpeed.256000.windows=256000
watchy.menu.UploadSpeed.256000.upload.speed=256000
watchy.menu.UploadSpeed.230400.windows.upload.speed=256000
watchy.menu.UploadSpeed.230400=230400
watchy.menu.UploadSpeed.230400.upload.speed=230400
watchy.menu.UploadSpeed.460800.linux=460800
watchy.menu.UploadSpeed.460800.macosx=460800
watchy.menu.UploadSpeed.460800.upload.speed=460800
watchy.menu.UploadSpeed.512000.windows=512000
watchy.menu.UploadSpeed.512000.upload.speed=512000

watchy.menu.DebugLevel.none=None
watchy.menu.DebugLevel.none.build.code_debug=0
watchy.menu.DebugLevel.error=Error
watchy.menu.DebugLevel.error.build.code_debug=1
watchy.menu.DebugLevel.warn=Warn
watchy.menu.DebugLevel.warn.build.code_debug=2
watchy.menu.DebugLevel.info=Info
watchy.menu.DebugLevel.info.build.code_debug=3
watchy.menu.DebugLevel.debug=Debug
watchy.menu.DebugLevel.debug.build.code_debug=4
watchy.menu.DebugLevel.verbose=Verbose
watchy.menu.DebugLevel.verbose.build.code_debug=5

##############################################################

deneyapkart1A.name=Deneyap Kart 1A

deneyapkart1A.upload.tool=esptool_py
deneyapkart1A.upload.maximum_size=1310720
deneyapkart1A.upload.maximum_data_size=327680
deneyapkart1A.upload.wait_for_upload_port=true
deneyapkart1A.upload.flags=
deneyapkart1A.upload.extra_flags=

deneyapkart1A.serial.disableDTR=true
deneyapkart1A.serial.disableRTS=true

deneyapkart1A.build.tarch=xtensa
deneyapkart1A.build.bootloader_addr=0x1000
deneyapkart1A.build.target=esp32
deneyapkart1A.build.mcu=esp32
deneyapkart1A.build.core=esp32
deneyapkart1A.build.variant=deneyapkart1A
deneyapkart1A.build.board=DYDK1A

deneyapkart1A.build.f_cpu=240000000L
deneyapkart1A.build.flash_size=4MB
deneyapkart1A.build.flash_freq=40m
deneyapkart1A.build.flash_mode=dio
deneyapkart1A.build.boot=dio
deneyapkart1A.build.partitions=default
deneyapkart1A.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue -mfix-esp32-psram-cache-strategy=memw
deneyapkart1A.build.extra_libs=

deneyapkart1A.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.default.build.partitions=default
deneyapkart1A.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
deneyapkart1A.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
deneyapkart1A.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
deneyapkart1A.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
deneyapkart1A.menu.PartitionScheme.default_8MB.upload.maximum_size=3342336
deneyapkart1A.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.minimal.build.partitions=minimal
deneyapkart1A.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.no_ota.build.partitions=no_ota
deneyapkart1A.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
deneyapkart1A.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
deneyapkart1A.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
deneyapkart1A.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
deneyapkart1A.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
deneyapkart1A.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
deneyapkart1A.menu.PartitionScheme.huge_app.build.partitions=huge_app
deneyapkart1A.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
deneyapkart1A.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
deneyapkart1A.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
deneyapkart1A.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
deneyapkart1A.menu.PartitionScheme.fatflash.build.partitions=ffat
deneyapkart1A.menu.PartitionScheme.fatflash.upload.maximum_size=2097152
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB=16M Flash (3MB APP/9MB FATFS)
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.build.partitions=app3M_fat9M_16MB
deneyapkart1A.menu.PartitionScheme.app3M_fat9M_16MB.upload.maximum_size=3145728
deneyapkart1A.menu.PartitionScheme.rainmaker=RainMaker
deneyapkart1A.menu.PartitionScheme.rainmaker.build.partitions=rainmaker
deneyapkart1A.menu.PartitionScheme.rainmaker.upload.maximum_size=3145728

deneyapkart1A.menu.CPUFreq.240=240MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.240.build.f_cpu=240000000L
deneyapkart1A.menu.CPUFreq.160=160MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.160.build.f_cpu=160000000L
deneyapkart1A.menu.CPUFreq.80=80MHz (WiFi/BT)
deneyapkart1A.menu.CPUFreq.80.build.f_cpu=80000000L
deneyapkart1A.menu.CPUFreq.40=40MHz
deneyapkart1A.menu.CPUFreq.40.build.f_cpu=40000000L
deneyapkart1A.menu.CPUFreq.20=20MHz 
deneyapkart1A.menu.CPUFreq.20.build.f_cpu=20000000L
deneyapkart1A.menu.CPUFreq.10=10MHz
deneyapkart1A.menu.CPUFreq.10.build.f_cpu=10000000L

deneyapkart1A.menu.FlashMode.qio=QIO
deneyapkart1A.menu.FlashMode.qio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.qio.build.boot=qio
deneyapkart1A.menu.FlashMode.dio=DIO
deneyapkart1A.menu.FlashMode.dio.build.flash_mode=dio
deneyapkart1A.menu.FlashMode.dio.build.boot=dio
deneyapkart1A.menu.FlashMode.qout=QOUT
deneyapkart1A.menu.FlashMode.qout.build.flash_mode=dout
deneyapkart1A.menu.FlashMode.qout.build.boot=qout
deneyapkart1A.menu.FlashMode.dout=DOUT
deneyapkart1A.menu.FlashMode.dout.build.flash_mode=dout
deneyapkart1A.menu.FlashMode.dout.build.boot=dout

