espressif/arduino-esp32/boards.txt
deneyapkart1A.menu.FlashFreq.80=80MHz
deneyapkart1A.menu.FlashFreq.80.build.flash_freq=80m
deneyapkart1A.menu.FlashFreq.40=40MHz
deneyapkart1A.menu.FlashFreq.40.build.flash_freq=40m

deneyapkart1A.menu.UploadSpeed.921600=921600
deneyapkart1A.menu.UploadSpeed.921600.upload.speed=921600
deneyapkart1A.menu.UploadSpeed.115200=115200
deneyapkart1A.menu.UploadSpeed.115200.upload.speed=115200
deneyapkart1A.menu.UploadSpeed.256000.windows=256000
deneyapkart1A.menu.UploadSpeed.256000.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400.windows.upload.speed=256000
deneyapkart1A.menu.UploadSpeed.230400=230400
deneyapkart1A.menu.UploadSpeed.230400.upload.speed=230400
deneyapkart1A.menu.UploadSpeed.460800.linux=460800
deneyapkart1A.menu.UploadSpeed.460800.macosx=460800
deneyapkart1A.menu.UploadSpeed.460800.upload.speed=460800
deneyapkart1A.menu.UploadSpeed.512000.windows=512000
deneyapkart1A.menu.UploadSpeed.512000.upload.speed=512000

deneyapkart1A.menu.DebugLevel.none=None
deneyapkart1A.menu.DebugLevel.none.build.code_debug=0
deneyapkart1A.menu.DebugLevel.error=Error
deneyapkart1A.menu.DebugLevel.error.build.code_debug=1
deneyapkart1A.menu.DebugLevel.warn=Warn
deneyapkart1A.menu.DebugLevel.warn.build.code_debug=2
deneyapkart1A.menu.DebugLevel.info=Info
deneyapkart1A.menu.DebugLevel.info.build.code_debug=3
deneyapkart1A.menu.DebugLevel.debug=Debug
deneyapkart1A.menu.DebugLevel.debug.build.code_debug=4
deneyapkart1A.menu.DebugLevel.verbose=Verbose
deneyapkart1A.menu.DebugLevel.verbose.build.code_debug=5

##############################################################